{
 "daddiu": 4478057,
 "$sp": 4564347,
 "-CONST": 2983778,
 "sd": 3521437,
 "$ra": 2125602,
 "CONST($sp)": 15158866,
 "$s4": 2728333,
 "$s3": 3335174,
 "$s2": 3907064,
 "$s1": 4763613,
 "$s0": 6216062,
 "($sp)": 290737,
 "lui": 1416013,
 "$at": 7069080,
 "CONST": 111375997,
 "daddu": 697115,
 "$v1": 4760371,
 "$t9": 17129273,
 "move": 16283033,
 "$a2": 3481327,
 "$a1": 6875176,
 "addiu": 7574885,
 "$zero": 5505997,
 "beq": 2129550,
 "$a0": 12271901,
 "nop": 6489402,
 "bne": 1607593,
 "$v0": 19713211,
 "b": 6638989,
 "sw": 4843045,
 "($s0)": 243611,
 "ld": 11688647,
 "-CONST($s3)": 16222,
 "lbu": 520819,
 "CONST($s4)": 101239,
 "bnez": 1248363,
 "bal": 2899793,
 "sb": 1642818,
 "srl": 95749,
 "beqz": 2223094,
 "CONST($s0)": 1389770,
 "dext": 140209,
 "lwl": 31564,
 "($v1)": 110379,
 "lwr": 31355,
 "-CONST($v1)": 51183,
 "($v0)": 840150,
 "lw": 14475515,
 "$t0": 517204,
 "$a3": 1401130,
 "$t1": 300626,
 "CONST($v1)": 165940,
 "ext": 34050,
 "$t2": 192517,
 "($t2)": 3642,
 "($t1)": 5928,
 "xor": 2153538,
 "sll": 578110,
 "$t3": 133336,
 "$t4": 84462,
 "$t5": 61290,
 "$t6": 51506,
 "andi": 378706,
 "($t3)": 3021,
 "($t4)": 2172,
 "($at)": 153351,
 "($t0)": 8518,
 "jr": 786241,
 "$fp": 1697797,
 "$gp": 6099426,
 "$s7": 1489405,
 "$s6": 1790835,
 "$s5": 2213549,
 "dsll": 276400,
 "sra": 37287,
 "dsll32": 17460,
 "-CONST($s0)": 1194121,
 "sdl": 18118,
 "CONST($t4)": 2381,
 "CONST($a3)": 18315,
 "CONST($a2)": 37985,
 "sdr": 18114,
 "CONST($t3)": 2998,
 "subu": 169633,
 "$t7": 43917,
 "$t8": 39508,
 "or": 453578,
 "xori": 65134,
 "ori": 170283,
 "addu": 755573,
 "mult": 5279,
 "mfhi": 27772,
 "($s3)": 112662,
 "($s5)": 61736,
 "($s7)": 44144,
 "($s6)": 52728,
 "($a0)": 119872,
 "($fp)": 108540,
 "($gp)": 685,
 "($a1)": 51112,
 "-CONST($gp)": 6705766,
 "jalr": 6264952,
 "CONST($s1)": 474050,
 "($s1)": 189808,
 "CONST($v0)": 886471,
 "slti": 80768,
 "-CONST($t5)": 457,
 "($t8)": 967,
 "($t6)": 1290,
 "($t7)": 1121,
 "($t5)": 1569,
 "dsubu": 59471,
 "-CONST($v0)": 113336,
 "($s4)": 79054,
 "ldl": 18058,
 "ldr": 15949768,
 "sltu": 343906,
 "dsrl": 14798,
 "sltiu": 206562,
 "and": 1542485,
 "CONST($s3)": 157196,
 "movz": 2657770,
 "-CONST($at)": 288662,
 "($a3)": 15673,
 "($s2)": 142874,
 "($a2)": 31452,
 "CONST($at)": 295849,
 "-CONST($a0)": 12548,
 "blez": 87122,
 "-CONST($t0)": 1899,
 "dsbh": 521,
 "dshd": 521,
 "CONST($s2)": 230862,
 "CONST($a0)": 281786,
 "lb": 129517,
 "bgez": 41295,
 "bltz": 70822,
 "srlv": 6032,
 "sllv": 12456,
 "dmultu": 1449,
 "CONST($s7)": 79361,
 "CONST($a1)": 93851,
 "seb": 12485,
 "dsllv": 3017,
 "CONST($s6)": 82013,
 "dsrlv": 2349,
 "movn": 188023,
 "slt": 162252,
 "-CONST($s1)": 77129,
 "negu": 11568,
 "bgtz": 68913,
 "mul": 258272,
 "mflo": 28899,
 "-CONST($fp)": 9155,
 "dsrl32": 8954,
 "ddivu": 3100,
 "teq": 16671,
 "CONST($fp)": 3686361,
 "CONST($t0)": 11667,
 "dmult": 7926,
 "-CONST($s4)": 11583,
 "not": 87184,
 "wsbh": 5461,
 "rotr": 27207,
 "-CONST($a3)": 2906,
 "-CONST($a2)": 4800,
 "lwu": 26710,
 "-CONST($s5)": 8853,
 "nor": 11199,
 "CONST($s5)": 83985,
 "($ra)": 183,
 "CONST($t6)": 1238,
 "($t9)": 926,
 "swl": 24104,
 "swr": 24091,
 "-CONST($s7)": 7902,
 "-CONST($s6)": 13994,
 "multu": 8968,
 "ins": 19174,
 "lhu": 109550,
 "sh": 58021,
 "-CONST($s2)": 23382,
 "-CONST($t2)": 850,
 "drotr32": 1702,
 "drotr": 1797,
 "-CONST($a1)": 13336,
 "push": 10132754,
 "arm_r4": 3759257,
 "arm_r5": 3092609,
 "arm_r6": 2596344,
 "arm_r7": 2158097,
 "arm_r8": 1638970,
 "sl": 1149384,
 "reg_base_pointer": 7176791,
 "lr": 1189745,
 "ip": 803864,
 "[reg_pc,CONST]": 1731902,
 "sub": 5902088,
 "reg_stack_pointer": 10448624,
 "[ip]": 22509,
 "str": 5931786,
 "[reg_stack_pointer,CONST]": 10518229,
 "mov": 59635715,
 "arm_r0": 11903369,
 "ldrb": 1028898,
 "arm_r2": 6833503,
 "cmp": 8393311,
 "arm_r3": 13598695,
 "arm_r1": 6303053,
 "lsr": 290774,
 "moveq": 111553,
 "andne": 7572,
 "add": 14871765,
 "bl": 11804776,
 "[arm_r3]": 601592,
 "movhs": 14914,
 "asr CONST": 55475,
 "smulleq": 12,
 "asr": 282956,
 "cmn": 95124,
 "cmneq": 703,
 "adds": 68275,
 "adcs": 2672,
 "movvs": 65,
 "movlt": 28594,
 "eors": 121306,
 "pop": 4315270,
 "reg_pc": 985143,
 "subs": 357890,
 "bge": 69634,
 "[reg_stack_pointer]": 3292343,
 "sbc": 20249,
 "sbcs": 20626,
 "umull": 18387,
 "sublt": 719,
 "adc": 112385,
 "mlane": 171,
 "umullne": 19,
 "movne": 124788,
 "addne": 18717,
 "orrs": 25433,
 "dsra": 9248,
 "srav": 3130,
 "endbr64": 298013,
 "[reg_base_pointer-CONST]": 12633281,
 "rdi": 6046726,
 "rax": 7957906,
 "[reg_base_pointer-8]": 341909,
 "jmp": 4349914,
 "movzx": 1282908,
 "eax": 24503310,
 "[rax]": 644726,
 "al": 2890554,
 "jne": 2241090,
 "call": 12633789,
 "lea": 6431783,
 "edx": 6623027,
 "[rax+CONST]": 1087016,
 "rcx": 1467074,
 "dl": 247971,
 "sete": 74272,
 "test": 3368787,
 "leave": 67916,
 "ret": 1433832,
 "rbx": 2577331,
 "rsi": 2598280,
 "rdx": 2480795,
 "fs:[CONST]": 224051,
 "[reg_pc+CONST]": 1244436,
 "esi": 6339424,
 "edi": 4683319,
 "js": 155804,
 "r9": 213179,
 "r8": 379276,
 "ecx": 5411406,
 "je": 3361226,
 "setne": 64431,
 "imul": 373450,
 "jle": 350961,
 "movabs": 92344,
 "sar": 318108,
 "r8d": 444761,
 "r9d": 286852,
 "[reg_base_pointer+CONST]": 1814166,
 "cdqe": 127720,
 "cmovae": 4084,
 "jb": 111439,
 "jae": 142936,
 "movsx": 194714,
 "seta": 19649,
 "shl": 560673,
 "cl": 398200,
 "ja": 178481,
 "jno": 180,
 "[rdx]": 69699,
 "jbe": 161361,
 "[rax*4]": 24871,
 "[rdx+rax]": 23567,
 "r12": 1589756,
 "r12d": 517039,
 "[reg_stack_pointer+CONST]": 9590490,
 "shr": 297898,
 "r12b": 28048,
 "r15": 1234740,
 "r14": 1452068,
 "r13": 1238240,
 "movsxd": 379915,
 "ebx": 4499367,
 "[r12+r12]": 929,
 "inc": 195976,
 "[rax+rdx*8]": 12716,
 "[rax+rbx*8]": 4271,
 "[reg_base_pointer]": 149355,
 "r15d": 341786,
 "jns": 79656,
 "cld": 477,
 "rep stosq": 3378,
 "[rdi]": 92393,
 "cdq": 65670,
 "idiv": 43854,
 "[reg_stack_pointer+r8*8+CONST]": 137,
 "dec": 70239,
 "[rax+rbx]": 3487,
 "[rax-1]": 25266,
 "setg": 10391,
 "jg": 179447,
 "cmovg": 24054,
 "setbe": 3765,
 "[rcx+rax+CONST]": 2286,
 "[arm_r5]": 86768,
 "tst": 299104,
 "[arm_r0]": 227445,
 "[arm_r2,arm_r1]": 2436,
 "[arm_r0,arm_r3,lsl CONST]": 1624,
 "strb": 486106,
 "bx": 205417,
 "[arm_r1]": 64007,
 "orreq": 6109,
 "orrseq": 96,
 "mvn": 146886,
 "ldm": 213977,
 "eor": 223346,
 "ble": 123729,
 "stm": 82797,
 "rsbs": 9324,
 "ands": 42880,
 "ldrne": 36539,
 "[arm_r7,CONST]": 112792,
 "cmpne": 29454,
 "[arm_r7]": 43994,
 "bic": 74568,
 "[arm_r0,-CONST]": 15269,
 "[arm_r0,CONST]": 338101,
 "biceq": 1282,
 "[arm_r7,-CONST]": 3808,
 "movle": 16718,
 "mvnle": 451,
 "[arm_r8]": 33429,
 "bls": 51325,
 "blo": 42489,
 "mla": 51289,
 "orr": 444845,
 "mvnne": 16758,
 "bgt": 78161,
 "blt": 114238,
 "[sb,CONST]": 85451,
 "[arm_r6]": 59284,
 "stmib": 9148,
 "bmi": 9827,
 "[sb]": 29477,
 "ldrbne": 4294,
 "[arm_r6,CONST]": 169647,
 "rscs": 1165,
 "movge": 25695,
 "[arm_r4]": 130058,
 "[arm_r0,arm_r4]": 715,
 "[arm_r2]": 105607,
 "[arm_r3,arm_r0]": 1369,
 "[sl]": 23825,
 "[arm_r6,arm_r2]": 1424,
 "[arm_r2,arm_r0]": 1416,
 "blge": 24,
 "stp": 1323450,
 "x29": 1571280,
 "x30": 849216,
 "[reg_stack_pointer,-CONST]": 293078,
 "x22": 1327286,
 "x21": 1655708,
 "x20": 2092047,
 "x19": 2683747,
 "x1": 4790078,
 "x0": 12169164,
 "cbz": 678362,
 "w0": 6601748,
 "adrp": 1421238,
 "[x22,CONST]": 109729,
 "w19": 504083,
 "w21": 414049,
 "[x0]": 694237,
 "w2": 1209923,
 "xzr": 338812,
 "x8": 1467812,
 "x3": 972984,
 "x4": 458131,
 "wzr": 400977,
 "w1": 2882312,
 "x2": 2610559,
 "tbz": 183263,
 "[x20]": 93985,
 "ldp": 1531133,
 "CONST($t2)": 3893,
 "div": 18517,
 "seh": 9622,
 "[reg_base_pointer,-CONST]": 3357516,
 "[arm_r3,CONST]": 655703,
 "[arm_r4,arm_r3]": 10676,
 "[reg_base_pointer,CONST]": 158158,
 "lsl": 831572,
 "ldrh": 229157,
 "[arm_r2,arm_r3]": 150714,
 "addls": 11324,
 "lsl CONST": 790619,
 "strh": 166678,
 "movhi": 9761,
 "movls": 8993,
 "bhi": 56022,
 "[reg_pc,-CONST]": 59364,
 "[arm_r1,arm_r2]": 17520,
 "ldrsh": 125465,
 "rsb": 69913,
 "[arm_r2,CONST]": 133903,
 "[arm_r1,CONST]": 144634,
 "ldrsb": 34356,
 "lsr CONST": 105996,
 "x23": 1007064,
 "[x23,CONST]": 71364,
 "[x22]": 43185,
 "b.hi": 81410,
 "w3": 628695,
 "[x19]": 148761,
 "b.hs": 58857,
 "[x23]": 28103,
 "w6": 221253,
 "x5": 267929,
 "[x4,CONST]": 33556,
 "[x1,x6,lsl CONST]": 374,
 "[x0,x6,lsl CONST]": 320,
 "[x5,x0,lsl CONST]": 561,
 "[x19,CONST]": 694974,
 "[x3,CONST]": 53776,
 "[x2,CONST]": 87804,
 "[x3]": 31603,
 "[x2]": 51792,
 "cbnz": 328332,
 "w4": 409961,
 "[x0,CONST]": 1021010,
 "[x0,w4,sxtw CONST]": 204,
 "b.ne": 615771,
 "tbnz": 211298,
 "[x1]": 116576,
 "[x1,CONST]": 202962,
 "b.eq": 795011,
 "[x1,x0]": 13501,
 "[x2,x0]": 3302,
 "cset": 89641,
 "eq": 79937,
 "x7": 125703,
 "b.ls": 70785,
 "w8": 1251859,
 "csel": 126595,
 "b.lo": 43072,
 "hi": 8565,
 "csinv": 1494,
 "hs": 4048,
 "[x4]": 18145,
 "ne": 94746,
 "ubfx": 22093,
 "ldurb": 25503,
 "[x19,-CONST]": 4378,
 "[x0,x19]": 818,
 "movk": 137709,
 "x6": 176911,
 "w7": 178842,
 "sturb": 28739,
 "[x5,-CONST]": 2220,
 "[x6,CONST]": 17786,
 "[x5]": 11230,
 "ccmp": 41795,
 "[x20,CONST]": 296801,
 "x24": 779951,
 "x25": 613473,
 "x26": 484813,
 "w26": 152489,
 "w25": 190774,
 "[x21,CONST]": 161912,
 "[x19,x0]": 1331,
 "[x21]": 59874,
 "[x19,x1]": 802,
 "[x4,x1]": 914,
 "w20": 465345,
 "b.gt": 116739,
 "w5": 295700,
 "[x24]": 21055,
 "[x26]": 12879,
 "w24": 231987,
 "x27": 387331,
 "blr": 80902,
 "[x0,x1,lsl CONST]": 14577,
 "stur": 311874,
 "w23": 280784,
 "x28": 325340,
 "[x26,CONST]": 41780,
 "[x28,CONST]": 42625,
 "[x22,w20,uxtw CONST]": 19,
 "[x27,CONST]": 38569,
 "movi": 12791,
 "v0.4s": 2416,
 "q0": 34503,
 "w22": 347465,
 "[x24,CONST]": 59522,
 "sxtw CONST": 21783,
 "[x25,CONST]": 46530,
 "[x25]": 14656,
 "neg": 91919,
 "lo": 9070,
 "[x5,CONST]": 21730,
 "csinc": 7600,
 "ubfiz": 21114,
 "cinc": 6746,
 "[x1,w2,uxtw CONST]": 69,
 "bfi": 12113,
 "[x22,x1]": 375,
 "[x28]": 9040,
 "x9": 577959,
 "[x25,-CONST]": 2464,
 "sxtw": 191578,
 "[x21,x19]": 557,
 "[x20,w3,uxtw CONST]": 9,
 "[x20,x2,lsl CONST]": 258,
 "dup": 2093,
 "v0.2d": 3936,
 "[x6]": 7806,
 "[x8]": 100411,
 "[x27]": 10450,
 "[x8,CONST]": 227094,
 "[x2,w1,uxtw CONST]": 113,
 "b.le": 148505,
 "bics": 8636,
 "gt": 16162,
 "x10": 252964,
 "x11": 140137,
 "[x10,CONST]": 17749,
 "w12": 108068,
 "x12": 89947,
 "b.ge": 57587,
 "w28": 113615,
 "w27": 132922,
 "lt": 18778,
 "[x22,x25]": 123,
 "x16": 25886,
 "br": 13633,
 "[x7,CONST]": 12336,
 "[x7,w2,sxtw CONST]": 53,
 "d8": 62674,
 "fmov": 74721,
 "ucvtf": 6427,
 "d0": 267315,
 "d1": 122202,
 "fmul": 110535,
 "fdiv": 23774,
 "ls": 11816,
 "[x22,w19,sxtw CONST]": 49,
 "sbfiz": 30809,
 "ldur": 555411,
 "b.lt": 75229,
 "[x21,x0,lsl CONST]": 1231,
 "[x22,x27]": 95,
 "[x24,w5,uxtw]": 4,
 "[x2,w0,sxtw CONST]": 389,
 "bfxil": 3960,
 "brk": 339,
 "udiv": 9532,
 "rev": 11859,
 "[x6,x1]": 527,
 "[x9,CONST]": 59245,
 "q1": 9724,
 "q2": 3776,
 "q3": 2566,
 "q4": 1522,
 "q5": 1306,
 "q6": 1324,
 "q7": 1130,
 "[x3,w2,sxtw]": 311,
 "[x3,w4,sxtw]": 184,
 "[x20,w1,sxtw]": 170,
 "[x8,x6,lsl CONST]": 129,
 "[x1,w20,uxtw CONST]": 34,
 "[x22,w1,uxtw]": 25,
 "adr": 10416,
 "sxtb CONST": 2261,
 "umaddl": 9095,
 "uxtw": 6694,
 "[x4,x0,lsl CONST]": 971,
 "[x4,w2,sxtw CONST]": 116,
 "[x20,w0,sxtw CONST]": 143,
 "[x20,x1,lsl CONST]": 511,
 "le": 23137,
 "[x1,w0,uxtw CONST]": 1271,
 "sxth CONST": 1646,
 "v0.16b": 24314,
 "v1.16b": 18124,
 "[x22,w24,uxtw CONST]": 28,
 "[x1,x19,lsl CONST]": 445,
 "[x2,-CONST]": 5141,
 "[x0,-CONST]": 15001,
 "[x0,x2]": 1416,
 "[x21,x20]": 504,
 "[x19,x20]": 336,
 "s0": 171123,
 "s1": 77727,
 "v0.s[1],v1.s[0]": 6,
 "v0.s[2]": 251,
 "ld1": 7707,
 "v0.s[3],[x2]": 1,
 "w9": 605641,
 "[x0,x20]": 886,
 "ge": 16203,
 "ldrsw": 145380,
 "[x1,-CONST]": 6468,
 "jal": 525442,
 "j": 261658,
 "clz": 14387,
 "divu": 6556,
 "CONST($t1)": 7386,
 "lh": 31862,
 "-CONST($t1)": 1394,
 "[rsi]": 54948,
 "[rsi+CONST]": 104593,
 "[r8+rcx*8]": 264,
 "[rdx+CONST]": 124922,
 "[r9+rcx*8]": 149,
 "[r8]": 11982,
 "[rcx]": 60607,
 "r14d": 401791,
 "r13d": 379936,
 "dil": 20152,
 "cmove": 60842,
 "[rdx+rdi*4]": 987,
 "r8b": 23786,
 "[rdi+rax]": 4059,
 "[rdx-CONST]": 3985,
 "[rsi+rax]": 4824,
 "[rsi+rcx]": 2406,
 "[rsi+rcx*8]": 552,
 "[rdi+CONST]": 281053,
 "r10": 120465,
 "r11": 85733,
 "[r8+CONST]": 25356,
 "[reg_base_pointer+r8*8+CONST]": 20,
 "[r10+r12]": 369,
 "[r11+r8]": 273,
 "[r12]": 56715,
 "[rbx+CONST]": 777695,
 "si": 22245,
 "[r14+CONST]": 196753,
 "[rax+r8*4]": 333,
 "[r15+r8*8]": 39,
 "[r13+CONST]": 163344,
 "[rdx*8]": 2900,
 "[rcx*4+CONST]": 866,
 "[rax+rcx*8]": 10197,
 "[rax*8]": 13771,
 "[rax*4+CONST]": 2810,
 "[rax+rsi*8]": 1338,
 "rep stosb": 2790,
 "[r12+CONST]": 202479,
 "[rsi-1]": 5901,
 "[r15+CONST]": 193739,
 "[r14*4]": 391,
 "[rdx+r14*8]": 116,
 "[rdx+rsi*8]": 1214,
 "r11b": 6054,
 "jl": 110043,
 "[r14-1]": 3383,
 "[r15]": 45490,
 "[rbx+r8*8+CONST]": 67,
 "[rax+r8*8]": 276,
 "[r12+rax+CONST]": 1745,
 "[r10]": 6392,
 "[rdx+rax*8]": 9785,
 "r11d": 127021,
 "[r14+r15]": 675,
 "cmova": 9146,
 "[reg_base_pointer-1]": 30177,
 "[rbx+r13*8+CONST]": 150,
 "[r12+rdx]": 1096,
 "[reg_base_pointer+rdx+CONST]": 869,
 "[reg_base_pointer+rax+CONST]": 2391,
 "[r12+rax]": 3446,
 "[r12+rcx+CONST]": 499,
 "[r8+rax*8+CONST]": 122,
 "[rdx+r13*8]": 117,
 "[reg_base_pointer+rcx+CONST]": 484,
 "[rax+r13*8]": 1699,
 "[r9]": 8672,
 "[r12+r8]": 206,
 "[rax+r13*4]": 627,
 "[r14]": 57027,
 "ax": 223368,
 "[r8+rbx]": 367,
 "[rbx]": 153668,
 "[rbx+rax+CONST]": 4560,
 "[r14+rcx*8]": 265,
 "[rax*8+CONST]": 9389,
 "[r14+rdx*8]": 309,
 "[r12+rdx*8+CONST]": 164,
 "[rcx+CONST]": 137801,
 "[r13-1]": 3125,
 "[rax+rdi*8]": 583,
 "r8w": 6728,
 "[rdi+rax*4+CONST]": 1141,
 "[r12-1]": 3624,
 "[rcx+rdx*8]": 3788,
 "movsd": 209939,
 "xmm0": 628641,
 "cvtsi2sd": 24983,
 "xmm1": 291941,
 "addsd": 35277,
 "xmm3": 93350,
 "mulsd": 47866,
 "xorps": 18649,
 "divsd": 17284,
 "cvttsd2si": 6291,
 "[reg_base_pointer*8]": 1382,
 "movapd": 36187,
 "xmm2": 144738,
 "subsd": 18853,
 "comisd": 14150,
 "[r12+rdx+CONST]": 649,
 "bt": 12414,
 "sil": 34214,
 "[r13]": 41403,
 "[rdi+rax*8+CONST]": 1187,
 "ucomisd": 14762,
 "jp": 9461,
 "r12w": 3815,
 "jge": 105350,
 "[r12+r15+CONST]": 433,
 "dx": 76121,
 "[r12+rbx]": 1518,
 "[rdi+rsi*8+CONST]": 248,
 "[r15+rax+CONST]": 1755,
 "cx": 43820,
 "[rax+rsi*4]": 801,
 "[r15+r12+CONST]": 421,
 "[rcx-1]": 7382,
 "[rsi+rax*4]": 2298,
 "[r13+r12+CONST]": 490,
 "r13b": 23937,
 "[rdi+r10*8+CONST]": 54,
 "[rdi+r9*8+CONST]": 76,
 "[reg_pc-CONST]": 36656,
 "movups": 65906,
 "[rcx*8]": 2347,
 "[reg_base_pointer+r15+CONST]": 356,
 "[rdi+rdi]": 885,
 "[r13+rcx]": 734,
 "[rbx+rsi*8]": 206,
 "[reg_base_pointer+rax]": 3278,
 "[rbx+rcx+CONST]": 1082,
 "cmovs": 13983,
 "[r12+r12+CONST]": 74,
 "[rax+rax]": 66435,
 "[rbx+r14*8]": 249,
 "[rbx+rax*8+CONST]": 2018,
 "[r12+reg_base_pointer]": 995,
 "[rax+rdx*2]": 2547,
 "r15w": 4041,
 "[rbx+rcx*8+CONST]": 460,
 "[rbx+rsi*8+CONST]": 279,
 "repne scasb": 4824,
 "r13w": 3840,
 "[r9+CONST]": 20554,
 "r10d": 160903,
 "rep movsb": 4887,
 "[r15+r13+CONST]": 334,
 "[r15+reg_base_pointer+CONST]": 408,
 "[rax+rax-1]": 345,
 "[rdx+rax*8+CONST]": 1070,
 "[r8+r12]": 396,
 "[r13+rax*8+CONST]": 628,
 "[r13+rdx*8+CONST]": 110,
 "[r15-1]": 2632,
 "[rax+rsi*2]": 637,
 "movaps": 68927,
 "ucomiss": 2984,
 "jnp": 1957,
 "cvtss2sd": 11429,
 "[rcx+rdx]": 4921,
 "cmovne": 53497,
 "[r13+rax]": 2337,
 "[r13+rdx]": 853,
 "[r14+rax+CONST]": 1576,
 "cmovge": 8795,
 "cmovle": 21585,
 "cmovl": 13083,
 "[r14+rbx+CONST]": 679,
 "reg_base_pointerl": 41999,
 "[r13+r13]": 662,
 "[rbx+rdx*8+CONST]": 558,
 "[r14+rax*2]": 491,
 "[r9+r9]": 625,
 "[rbx+reg_base_pointer*8+CONST]": 655,
 "[r10+reg_base_pointer]": 180,
 "[rbx+r14*8+CONST]": 164,
 "setae": 4120,
 "r15b": 24063,
 "[rax+rcx]": 8570,
 "[rax+rdx+CONST]": 2811,
 "[rbx+rax*4+CONST]": 1839,
 "r14w": 3924,
 "sbb": 65724,
 "[rsi+rdx*8]": 1021,
 "[rdi-1]": 2595,
 "[rax+rsi*4+CONST]": 317,
 "[r9-1]": 1592,
 "[r12+rax*4+CONST]": 638,
 "[r12+rdx*4+CONST]": 199,
 "[reg_stack_pointer-8]": 10346,
 "[reg_stack_pointer-4]": 3731,
 "[rdx+rdi*8]": 286,
 "[rdi+rax+CONST]": 2632,
 "[rdx+rax+CONST]": 6599,
 "[rdx+rax*4+CONST]": 1149,
 "[rdx+rcx*4+CONST]": 408,
 "[rbx+rdx+CONST]": 1458,
 "[rcx+rax*8]": 5406,
 "r9w": 4492,
 "[r10-1]": 888,
 "[r14+rax*4+CONST]": 449,
 "[rbx+r15*8+CONST]": 119,
 "[rax+reg_base_pointer]": 2733,
 "[rdx+rcx*8+CONST]": 416,
 "[rdx+rcx]": 3339,
 "[reg_base_pointer+rsi]": 418,
 "[rdx+rdi]": 797,
 "[r9+rsi]": 557,
 "[reg_base_pointer+r9]": 210,
 "[rbx+r9*8+CONST]": 57,
 "[r11+r13]": 227,
 "[r8+r15+CONST]": 28,
 "[r15+rcx*8]": 274,
 "[r8+rcx+CONST]": 459,
 "[reg_base_pointer+rcx*8+CONST]": 212,
 "[rdx+r15]": 312,
 "[rbx+rax]": 6588,
 "[r15+rbx]": 1276,
 "[reg_base_pointer+rsi*8+CONST]": 751,
 "[r13+rax*8]": 1234,
 "[rcx+rbx*8]": 500,
 "r14b": 29243,
 "[rax+rax+CONST]": 1682,
 "[r12+rsi+CONST]": 184,
 "[r9+rbx]": 361,
 "[reg_base_pointer+rbx*8+CONST]": 597,
 "[r8+r13]": 280,
 "[rdx+rsi*8+CONST]": 183,
 "[r12+r10+CONST]": 109,
 "[r14+rax*8]": 1748,
 "[r11]": 4583,
 "[r13+rdx*4]": 446,
 "[r10+r9]": 410,
 "[rsi+rax+CONST]": 1774,
 "[rdx+rcx*2]": 713,
 "[rdi+rcx*4+CONST]": 337,
 "[rbx*4]": 1026,
 "[rbx-1]": 6871,
 "[reg_base_pointer+r14]": 467,
 "[rax-4]": 3756,
 "[r10+CONST]": 18150,
 "[reg_base_pointer+rdi+CONST]": 184,
 "di": 15816,
 "[r15+r12]": 639,
 "[r15+reg_base_pointer]": 1074,
 "[r14+reg_base_pointer*8]": 816,
 "[rdx+reg_base_pointer+CONST]": 190,
 "r10b": 8420,
 "[rax+rcx+CONST]": 3874,
 "[rdx+rcx+CONST]": 1196,
 "[rax-CONST]": 13456,
 "r11w": 2691,
 "[rdx+r8+CONST]": 177,
 "[r11+CONST]": 11618,
 "[rbx+rdi]": 456,
 "[rdx+rdi+CONST]": 395,
 "[r9+r15]": 137,
 "[rdx+r14+CONST]": 132,
 "[r9+r8]": 439,
 "[rcx+rdx*4]": 2384,
 "r9b": 13462,
 "[r13+rax-1]": 110,
 "[r13+rdi]": 222,
 "[rdx+r11*8]": 43,
 "[r10+r11]": 315,
 "[r8+rax]": 1812,
 "[r15+rax]": 2529,
 "[r10+rax*4]": 807,
 "[r8+rax*8]": 402,
 "[r13+reg_base_pointer*8]": 401,
 "[r9+rax]": 1510,
 "[reg_stack_pointer+rbx+CONST]": 673,
 "[r14+rbx*8]": 1043,
 "[rbx+r15]": 727,
 "[r12+rax-1]": 166,
 "[rax+r14]": 1800,
 "[reg_base_pointer+r12]": 585,
 "[r15+reg_base_pointer*8]": 420,
 "bh": 4817,
 "[rdi+rcx+CONST]": 828,
 "[r10+rcx+CONST]": 211,
 "[r10+rax]": 1382,
 "[r8+rdi]": 428,
 "[rsi+rbx*8]": 198,
 "[rdx+rbx]": 777,
 "[reg_base_pointer+rdi]": 413,
 "[r12+rbx+CONST]": 945,
 "[rax+r14*2]": 268,
 "[r13+rdx+CONST]": 467,
 "[rcx+r12]": 696,
 "[rdx+r12*8]": 165,
 "[r15+r13*2]": 71,
 "[rbx-CONST]": 5682,
 "[rbx+reg_base_pointer]": 1634,
 "[rsi+r8*8]": 103,
 "[r15-CONST]": 2079,
 "[r14-CONST]": 1556,
 "[r13-CONST]": 3787,
 "[r12-CONST]": 2076,
 "[r14+rdx+CONST]": 580,
 "[rdx+rax*4]": 6491,
 "[rdi+rax*8]": 2802,
 "[r11+rdx]": 618,
 "[rdx+rcx*8]": 1837,
 "[rbx+r9]": 375,
 "[r14+rax*4]": 1464,
 "[r12*4]": 429,
 "[rax+rdx]": 7500,
 "[rdx+rax-2]": 140,
 "[rdx*4+CONST]": 354,
 "[rsi+rcx*4]": 794,
 "[rax+reg_base_pointer*8]": 3217,
 "[reg_stack_pointer-CONST]": 53277,
 "[rax-8]": 4964,
 "[rbx-2]": 1141,
 "[reg_base_pointer+rbx*8]": 942,
 "[rcx+rdx*2]": 921,
 "[reg_base_pointer+rdx*8]": 508,
 "[r15+rcx]": 972,
 "[rdx+rax*2]": 1415,
 "[r8+rdx*8]": 253,
 "[r9+rdx]": 836,
 "[rax+r12+CONST]": 576,
 "[rdx-1]": 6321,
 "[rax+r12]": 2081,
 "[r13+rbx]": 990,
 "[r13+rbx+CONST]": 644,
 "[rdi+rsi*8]": 452,
 "setle": 3705,
 "[rcx+rax]": 9524,
 "[r10+r9-6]": 3,
 "[r10+r9+CONST]": 315,
 "[rax+r9*8]": 181,
 "[r9+rax+CONST]": 1049,
 "r10w": 3709,
 "[rbx+rbx]": 2176,
 "[r11-1]": 678,
 "[reg_stack_pointer+rdx+CONST]": 1054,
 "[reg_stack_pointer+r11+CONST]": 74,
 "[r13+rcx+CONST]": 396,
 "[r13+r8+CONST]": 82,
 "[rbx+rax*8]": 3126,
 "[rax+rbx+CONST]": 1391,
 "[rdi+rsi]": 2309,
 "[r10+rax+CONST]": 587,
 "[rcx+r15]": 567,
 "cmovbe": 13063,
 "[rsi+rdi*4+CONST]": 185,
 "[rsi+rcx*4+CONST]": 288,
 "[rsi+rdx]": 2522,
 "[rdx+r15+CONST]": 235,
 "[reg_base_pointer+rdx*4+CONST]": 297,
 "[r15+rdx+CONST]": 628,
 "[r13+rax+CONST]": 1377,
 "[rdi+rsi*4+CONST]": 322,
 "[r12+rax*8+CONST]": 606,
 "cmovb": 9216,
 "[r15+rax*8]": 1813,
 "[rax+rdx*4]": 6396,
 "rep stosd": 11347,
 "[rax+r10]": 649,
 "[rax+r11*8]": 101,
 "rep movsd": 8112,
 "[rbx+rdx*4+CONST]": 727,
 "[rbx+rdx]": 1519,
 "[rax+r15]": 1840,
 "[r13+r15*8]": 223,
 "[reg_base_pointer+rax*4+CONST]": 924,
 "[rbx+rdx-1]": 60,
 "[rax+r14*8]": 1875,
 "[rbx+r8*4+CONST]": 112,
 "[reg_stack_pointer+r8+CONST]": 155,
 "[rdx+r14]": 489,
 "[rsi+rax*4+CONST]": 927,
 "[rax+rcx*2+CONST]": 898,
 "[rax+rdx*2+CONST]": 1264,
 "[rax+r10*8]": 300,
 "[reg_stack_pointer+rdx*4+CONST]": 684,
 "[r13+rax*4]": 1649,
 "[r9+rcx+CONST]": 230,
 "[r9-6]": 84,
 "[rsi-2]": 961,
 "[r9-2]": 498,
 "[rdi-2]": 1051,
 "[r12*8]": 735,
 "[r11*8]": 206,
 "[rax+r11]": 599,
 "[r15+r11]": 173,
 "[r13+r11*8]": 26,
 "[rdi+rax*4]": 2545,
 "[reg_base_pointer+rcx*8]": 289,
 "[reg_base_pointer+rax*8]": 1876,
 "[r14+rcx]": 944,
 "[r14+rcx+CONST]": 443,
 "[r13+r15*4]": 227,
 "[reg_base_pointer-4]": 125347,
 "[rsi+rax*8]": 1686,
 "[r15-2]": 433,
 "[r14+rdx]": 859,
 "[r10+rdx]": 677,
 "[reg_stack_pointer+rcx*2+CONST]": 225,
 "[rcx+rdx*4+CONST]": 493,
 "[rdi*8]": 585,
 "[rax+rcx*2]": 1562,
 "[rbx+rcx*8]": 666,
 "[r8+rax-8]": 45,
 "[rdi+rcx*8]": 566,
 "[r13+r13+CONST]": 69,
 "[r8-1]": 1972,
 "[rax+rdx*4+CONST]": 4243,
 "[rbx+reg_base_pointer*4+CONST]": 877,
 "[rbx+rcx*4+CONST]": 567,
 "[reg_base_pointer+r12+CONST]": 707,
 "[r15+rcx*4+CONST]": 163,
 "[rax+r15*8]": 1407,
 "[rcx+r15*8]": 255,
 "-1": 13487,
 "btc": 318,
 "[r8+rdx+CONST]": 457,
 "xmm5": 63094,
 "xmm4": 70223,
 "[r10+reg_base_pointer+CONST]": 63,
 "[rdx+r10]": 568,
 "movss": 98861,
 "[rdx+reg_base_pointer*4]": 286,
 "comiss": 5428,
 "[rdx+reg_base_pointer*4+CONST]": 23,
 "movq": 37700,
 "[rcx+rdx+CONST]": 2763,
 "[rbx+r11]": 352,
 "cvtsd2ss": 6377,
 "[r14+r14+CONST]": 63,
 "[r15+rcx+CONST]": 544,
 "andps": 3626,
 "setp": 578,
 "setnp": 631,
 "divss": 4852,
 "[rdi+rax*2+CONST]": 410,
 "xmm6": 56664,
 "xmm7": 64565,
 "[rsi+rax*2]": 1454,
 "[rax+rsi+CONST]": 849,
 "[rsi+rcx+CONST]": 1194,
 "[rdx+rax*4-4]": 116,
 "[rcx+rsi+CONST]": 527,
 "[r15+rdx*8]": 375,
 "[rax+rcx*4]": 5087,
 "[rdi+rax*2]": 1519,
 "[rdx+r11]": 491,
 "[rsi+rcx*2]": 492,
 "[rcx+rax*2]": 1451,
 "addss": 19191,
 "[reg_stack_pointer+rax+CONST]": 3652,
 "[r15+rcx*4]": 259,
 "[rsi+rdx*2]": 596,
 "[rcx+rsi]": 1402,
 "[r13+rdx*8]": 312,
 "[r13+rcx*2]": 102,
 "[rdx+rdi*2]": 198,
 "[r13+rdx*2]": 206,
 "[reg_base_pointer+rcx*2]": 170,
 "[rdx+r8*2]": 177,
 "[r10+rdi*2]": 64,
 "[r14+rbx]": 1392,
 "[r13+rbx*8]": 792,
 "[reg_base_pointer+r8+CONST]": 145,
 "setb": 9078,
 "[rdi+rsi+CONST]": 845,
 "[rsi+rbx]": 589,
 "[reg_base_pointer+rbx*4+CONST]": 597,
 "[reg_base_pointer+rbx+CONST]": 1702,
 "[rax+r13]": 3079,
 "[r12+rbx*8]": 1305,
 "[r13+rdi+CONST]": 174,
 "[r13+rsi*4+CONST]": 57,
 "[r15+rdx]": 796,
 "[r12+rdx*8]": 286,
 "[r11+rbx*8]": 40,
 "[rbx+r14]": 851,
 "[r9+rbx*8]": 81,
 "[reg_stack_pointer+r14+CONST]": 218,
 "[reg_stack_pointer+r14*8+CONST]": 163,
 "[rdi+r8+CONST]": 366,
 "[rdi+rdx+CONST]": 897,
 "[r15+rax*4+CONST]": 611,
 "[reg_stack_pointer+rax*4+CONST]": 1560,
 "[reg_stack_pointer+rax*2+CONST]": 483,
 "[reg_stack_pointer+r14*4+CONST]": 243,
 "[reg_stack_pointer+r14*2+CONST]": 17,
 "[reg_base_pointer-3]": 646,
 "cqo": 5941,
 "[r13+rax*4+CONST]": 570,
 "[rdx+rdi*4+CONST]": 127,
 "[rsi+r13]": 418,
 "[r15+rax*2]": 505,
 "[rsi+r14]": 282,
 "[rdx+rbx*8]": 351,
 "[r13+r14*8]": 289,
 "[rcx+r14*2]": 103,
 "[r12+rbx*4+CONST]": 320,
 "[rdx*8-1]": 10,
 "rol": 36699,
 "[rax*8-1]": 16,
 "[rbx+r9*4+CONST]": 82,
 "[rcx+rax*4]": 5863,
 "[rbx+r13*4+CONST]": 218,
 "[rbx+rax*4]": 2166,
 "[r15+rdx*4+CONST]": 198,
 "[reg_stack_pointer+rbx*8+CONST]": 379,
 "[reg_stack_pointer+r13*8+CONST]": 147,
 "[reg_stack_pointer+r13*2+CONST]": 25,
 "[r8+rax*4+CONST]": 343,
 "[reg_base_pointer+rcx]": 1034,
 "[rcx+rax*4+CONST]": 966,
 "[r9+rax*4+CONST]": 391,
 "[rax+r12*4]": 731,
 "[rbx+reg_base_pointer+CONST]": 1624,
 "[rcx+rax*8+CONST]": 1162,
 "[r14+r9*4]": 81,
 "[r10+rax*8]": 283,
 "[r10+rdx*8]": 94,
 "[r10+r8*8]": 51,
 "[rcx-3]": 289,
 "[rsi+rdx*4+CONST]": 283,
 "[rax+r9+CONST]": 347,
 "[r8+rcx*8+CONST]": 39,
 "[r10+r9*4]": 105,
 "[rdx-2]": 1102,
 "[rax+r14+CONST]": 466,
 "[rsi+reg_base_pointer*4]": 129,
 "[rsi+rbx*4]": 179,
 "[rax+reg_base_pointer*4]": 980,
 "[rax+rbx*4]": 1406,
 "ah": 21160,
 "[rdi+rdx]": 2209,
 "[rdi+r11]": 551,
 "[reg_base_pointer+rdx]": 1648,
 "[r11+rcx]": 675,
 "[r8-6]": 99,
 "[r11-8]": 171,
 "[r8-5]": 69,
 "[r13+rax*2+CONST]": 228,
 "dh": 7124,
 "[rcx+reg_base_pointer*8]": 363,
 "[r10-CONST]": 883,
 "[rax+r9]": 895,
 "[r11+r9]": 289,
 "[rax+r11+CONST]": 211,
 "[r13*8]": 1533,
 "[rdi+r12]": 440,
 "[rcx+r12*8]": 158,
 "ch": 5650,
 "[rcx+rax-1]": 356,
 "[rbx+rax*2+CONST]": 640,
 "[r12-4]": 371,
 "[r9*8]": 317,
 "[r13+rdx*4+CONST]": 168,
 "[r13+r15*4+CONST]": 125,
 "[r14+rax*2+CONST]": 214,
 "[r13+r11*2+CONST]": 5,
 "[r13+reg_base_pointer+CONST]": 427,
 "[r12+rcx]": 968,
 "[reg_stack_pointer+rbx*2+CONST]": 58,
 "[r8*8]": 415,
 "[reg_stack_pointer+rdx*8+CONST]": 342,
 "[r15+r8-1]": 1,
 "[reg_base_pointer+rsi+CONST]": 227,
 "[r14+rsi*4+CONST]": 132,
 "[reg_stack_pointer+rsi*2+CONST]": 198,
 "[r14+rbx*4+CONST]": 287,
 "[r14+r8]": 219,
 "[r8+rcx*2-2]": 10,
 "[r8+rcx*2]": 220,
 "[rdi+r11*4+CONST]": 67,
 "[r9+rdx*2]": 220,
 "[rbx+r15*4+CONST]": 291,
 "[rdx+reg_base_pointer*8]": 230,
 "[r14+rdx*4+CONST]": 160,
 "[reg_base_pointer+r15*2]": 86,
 "[r14+rcx*4+CONST]": 108,
 "[reg_base_pointer+r13*2]": 28,
 "[r8-CONST]": 1343,
 "[r12+rcx*4+CONST]": 139,
 "[r12+r13*4+CONST]": 142,
 "[rcx+rsi*4+CONST]": 195,
 "[reg_stack_pointer+rdx*2+CONST]": 310,
 "[r12+rax*8]": 2002,
 "[r12+reg_base_pointer*8]": 633,
 "[rsi+rsi]": 1274,
 "[rbx+r13*8]": 324,
 "[reg_base_pointer+reg_base_pointer]": 1598,
 "[rsi-8]": 859,
 "[reg_base_pointer+r15]": 404,
 "setl": 3113,
 "[r14*8]": 626,
 "[r13+rax*2]": 509,
 "[rdx+rsi+CONST]": 609,
 "[rsi+rax*2+CONST]": 545,
 "[r15+rax-1]": 102,
 "[rax+rbx*4+CONST]": 237,
 "[r11+rcx*4+CONST]": 71,
 "[rdi+r10]": 828,
 "[reg_base_pointer+rax*2+CONST]": 318,
 "[rax+r12*8]": 1715,
 "[r10*4]": 315,
 "[r9+rcx*4]": 289,
 "[r9+r11]": 256,
 "[r9+r11+CONST]": 61,
 "[r15+reg_base_pointer*4]": 190,
 "[rcx+reg_base_pointer]": 803,
 "[r15+r9*4]": 103,
 "[reg_base_pointer+r15*4+CONST]": 94,
 "[reg_base_pointer+r9*4+CONST]": 29,
 "[reg_base_pointer+rsi*4+CONST]": 116,
 "[rbx+rsi]": 779,
 "[reg_base_pointer+r12*8]": 358,
 "[r13+rcx*2+CONST]": 42,
 "[rdx+r12*2]": 83,
 "[reg_base_pointer+r9*8]": 50,
 "[rax+r8]": 972,
 "[r8+rdx]": 929,
 "[r8+rax+CONST]": 841,
 "[r8+rax*2+CONST]": 105,
 "[rdi+rax-6]": 4,
 "[r11+r14]": 233,
 "[reg_stack_pointer+rax*8+CONST]": 1264,
 "[reg_stack_pointer+r15*8+CONST]": 161,
 "[r15*4]": 396,
 "[rax+r15*4]": 796,
 "[r13+reg_base_pointer*8+CONST]": 172,
 "[rbx*8]": 1565,
 "[r12+r15]": 649,
 "[r9+rax*8]": 342,
 "[r9+r15*8]": 29,
 "setge": 1763,
 "[rsi-CONST]": 4043,
 "[reg_stack_pointer+rcx*8+CONST]": 380,
 "[r13+rbx*2]": 166,
 "[r15+rax*2+CONST]": 280,
 "[r9+r8*4]": 142,
 "[r9+rax*4]": 941,
 "[r8+r9*4]": 153,
 "[r8+reg_base_pointer*8]": 17,
 "[r15+r15]": 636,
 "[reg_stack_pointer+r12*2+CONST]": 35,
 "[rdx+rsi*4+CONST]": 153,
 "[r15+rsi*8]": 102,
 "[rdi+rdx*2]": 688,
 "[rdi+rax-CONST]": 95,
 "[r15+r13]": 587,
 "[rdx+r9*8]": 73,
 "[rdi-4]": 1356,
 "[r11+rcx*4]": 261,
 "[rcx+rsi*4]": 657,
 "[rdi+rcx*4]": 2462,
 "[rcx+r15*2]": 68,
 "[r14+r12]": 479,
 "[reg_stack_pointer+r12*8+CONST]": 168,
 "cwde": 22443,
 "[rdx+r14*4]": 163,
 "[rax+r15+CONST]": 504,
 "[rsi+rax*8+CONST]": 609,
 "[rcx+r11*4]": 80,
 "[rdx+rcx*4]": 1893,
 "[rsi+rdx*4]": 936,
 "[r14+rsi*8]": 95,
 "[rbx+r12*8+CONST]": 251,
 "[rsi+r8]": 731,
 "[rdi+r9*8]": 88,
 "[r11+rax]": 1353,
 "[r14*4+CONST]": 241,
 "[rdi+rdx*4]": 811,
 "[r9+r8*2+CONST]": 48,
 "[rbx+rcx]": 1573,
 "[rdi+rcx*2]": 470,
 "[rcx+r8]": 766,
 "[rbx+r12*4+CONST]": 349,
 "[reg_stack_pointer+rdi+CONST]": 285,
 "[reg_stack_pointer+r9*2+CONST]": 37,
 "[r12+rdx*2+CONST]": 68,
 "[r15+rdx*2]": 166,
 "[r12+r9*2]": 90,
 "[r12+rdx*2]": 302,
 "[r12+reg_base_pointer*2]": 160,
 "[rdx+rdx]": 5314,
 "[r12+rsi*2]": 107,
 "[reg_base_pointer+rax*2]": 643,
 "andnps": 303,
 "orps": 1847,
 "[rdx+r13]": 600,
 "[rdx+r12+CONST]": 263,
 "[r11+r8+CONST]": 157,
 "cvtsi2ss": 15103,
 "mulss": 29652,
 "[r8+r8]": 712,
 "[rdi+r8*8]": 208,
 "[r15+rax*4]": 1429,
 "[r15+r13*4]": 125,
 "[r12+rax*4]": 1805,
 "[r13+rsi*4]": 218,
 "[rdi+r8]": 905,
 "[rdi+rcx]": 2608,
 "[reg_stack_pointer+r13*4+CONST]": 216,
 "[rdx+rdx*4]": 1639,
 "[r13+r14*8+CONST]": 117,
 "[rax+rdi]": 1229,
 "[rbx-4]": 1356,
 "[rbx-8]": 2151,
 "[r15*8+CONST]": 145,
 "[rbx+reg_base_pointer*8]": 641,
 "[r15*8]": 552,
 "[rcx+r12+CONST]": 116,
 "[r8-8]": 325,
 "[rax+rsi]": 2160,
 "[rdx-8]": 873,
 "[rax+rdx*8+CONST]": 3205,
 "[rax+r13+CONST]": 460,
 "[r8+rcx]": 1371,
 "[rbx+rdx*4]": 634,
 "[rdx+r15*4]": 235,
 "[rsi*4]": 815,
 "[rdx+rsi*4]": 788,
 "[rdi+rsi*4]": 435,
 "[rdi*4]": 756,
 "[rax+rdi*4]": 452,
 "[reg_stack_pointer+reg_base_pointer*4+CONST]": 829,
 "[rax+r14*4]": 852,
 "cmovns": 11976,
 "[rax+rcx*8+CONST]": 1665,
 "[rax+rsi*8+CONST]": 269,
 "[rcx+rsi*8+CONST]": 182,
 "[rdi-CONST]": 3968,
 "[r12+r14]": 639,
 "[r14+rbx*8+CONST]": 336,
 "[r8*4]": 474,
 "[rdx*8+CONST]": 866,
 "[rsi+rdx*8+CONST]": 297,
 "[reg_base_pointer+rax*4]": 1939,
 "[rdx+r12]": 699,
 "[rsi-4]": 778,
 "[r8+rdx*4]": 519,
 "[r14+r12*8-8]": 9,
 "[r14+r12*8]": 309,
 "[r14+r8*4]": 103,
 "[r13*4]": 593,
 "[rax+rsi-CONST]": 57,
 "[reg_base_pointer+rax-1]": 238,
 "[rdi-8]": 3598,
 "[rcx-CONST]": 4224,
 "lock add": 555,
 "[reg_stack_pointer+r15+CONST]": 214,
 "[rbx+r15+CONST]": 626,
 "[r8+rcx-1]": 38,
 "[reg_base_pointer-2]": 2822,
 "[reg_base_pointer-5]": 2422,
 "[r13+rsi]": 306,
 "[r15+rdx*4]": 400,
 "[rax+rax*2]": 18336,
 "[reg_stack_pointer+rcx+CONST]": 866,
 "[r12-2]": 877,
 "[rsi+rdx+CONST]": 880,
 "[rax+reg_base_pointer-CONST]": 93,
 "[rdi+rsi-2]": 88,
 "[rdi+rsi-1]": 125,
 "[rdi+rbx]": 1057,
 "[r13+r9*2]": 42,
 "[r14+rdx*2]": 228,
 "[rax+r9*2]": 190,
 "[r12+rax*2]": 590,
 "[rcx+rsi*8]": 1079,
 "[rdi-9]": 29,
 "[reg_base_pointer-6]": 1110,
 "[r12-7]": 40,
 "[rdx-4]": 1595,
 "[r9+rcx]": 793,
 "[r14+r15*4]": 175,
 "[rax+r13*2]": 299,
 "[r12+rbx*2+CONST]": 73,
 "[r12+r13*2+CONST]": 14,
 "[r12+rax*2+CONST]": 283,
 "[rbx+rdx*2+CONST]": 151,
 "[r14+rsi*2]": 100,
 "[r8+rax*4]": 1328,
 "[reg_base_pointer*4]": 1910,
 "[rcx+r13]": 589,
 "[rbx+r12*2+CONST]": 159,
 "[rbx+rcx*2+CONST]": 137,
 "[r15+rcx*2+CONST]": 60,
 "[rdi+rdx*8]": 627,
 "[reg_base_pointer+rcx*4]": 413,
 "[rdi+rdx*8+CONST]": 275,
 "[reg_base_pointer+rdx*8+CONST]": 180,
 "[r8+rsi*8]": 179,
 "[rbx+r8*4]": 155,
 "[reg_base_pointer-9]": 6744,
 "[reg_stack_pointer+rbx*4+CONST]": 311,
 "[r12-5]": 51,
 "[r12+rbx*4]": 755,
 "[r14+r15*4+CONST]": 126,
 "[r14+rdx*4]": 460,
 "[rcx+r15*4]": 224,
 "[rbx+r15*2+CONST]": 66,
 "[r12+r14*8]": 597,
 "[r12+r14*4]": 229,
 "[r12+rdx*4]": 738,
 "[rsi*8]": 759,
 "[r14+rax*8+CONST]": 610,
 "subss": 10868,
 "[r12+rbx*8+CONST]": 350,
 "[rcx-2]": 1032,
 "[reg_base_pointer+r12-2]": 15,
 "[reg_base_pointer+r15*4]": 236,
 "[rax+r15*2]": 178,
 "[rbx+r14*2]": 98,
 "[rbx+r10*4]": 95,
 "[rdx+r10*4]": 206,
 "[rdx+r11*4]": 54,
 "[rbx+r11*4]": 69,
 "[rdx+r8*4]": 267,
 "[rcx+rdi*8]": 374,
 "[reg_base_pointer+rbx]": 1160,
 "[r9+r12*4]": 63,
 "[r9+r15*4]": 54,
 "[reg_stack_pointer+rdx*4]": 82,
 "[4]": 11,
 "ud2": 561,
 "[r13+r8*8]": 35,
 "[r13+rcx*8]": 214,
 "[CONST]": 154276,
 "[rdx+rax-CONST]": 226,
 "[r9+rax*8+CONST]": 123,
 "[rcx+r8*8]": 120,
 "[r14+r12*4]": 134,
 "[r13+r12*4]": 207,
 "[r12-8]": 517,
 "[rsi+rdi*8]": 328,
 "[rdx*4]": 2405,
 "[r13+rbx*4]": 361,
 "[r15+rbx*4]": 372,
 "[reg_stack_pointer+rcx*4+CONST]": 758,
 "[reg_stack_pointer+r13+CONST]": 236,
 "[reg_stack_pointer+r15*4+CONST]": 155,
 "[r15+r9]": 258,
 "[r8+rbx*4]": 41,
 "[rcx+rbx]": 721,
 "[r13+rbx*4+CONST]": 256,
 "[r14+r13*4]": 109,
 "[rcx+rbx*4]": 349,
 "[r8+r9*8]": 82,
 "[r13+r15+CONST]": 289,
 "[rax+reg_base_pointer+CONST]": 832,
 "[rcx+rax*2+CONST]": 591,
 "[rax+reg_base_pointer*4+CONST]": 111,
 "[r14+r15+CONST]": 394,
 "[rax+reg_base_pointer*2]": 529,
 "[reg_base_pointer+rcx-1]": 92,
 "[rax+reg_base_pointer-1]": 95,
 "[r14+rax]": 2742,
 "[r13-2]": 484,
 "[rax-2]": 3771,
 "[rbx+rbx*4+CONST]": 45,
 "[rbx+r15*8-CONST]": 1,
 "[r14+r15*8]": 306,
 "[reg_base_pointer+rsi-8]": 49,
 "maxsd": 839,
 "minsd": 891,
 "[r13+reg_base_pointer*4]": 254,
 "[r15+r14*2+CONST]": 43,
 "[rbx+r14+CONST]": 705,
 "[rdx+r11+CONST]": 249,
 "[rdx+rdx+CONST]": 631,
 "[r14+r15*8+CONST]": 163,
 "[rdi+rdi*2+CONST]": 32,
 "[r11+rdi]": 276,
 "[r13-8]": 581,
 "[r15-8]": 436,
 "[rsi+rsi+CONST]": 239,
 "[r12+r15*8]": 288,
 "[rax+rbx*2]": 723,
 "[r10+rax*4+CONST]": 194,
 "[rbx+rax-1]": 238,
 "[rbx+r14*4]": 217,
 "[r13+r14*4]": 269,
 "[rsi+reg_base_pointer]": 747,
 "[rax+r14*2+CONST]": 38,
 "[rcx+r12*4]": 194,
 "[r9+rdx*8]": 140,
 "[rdx+r8-1]": 17,
 "[rdx+rcx-1]": 185,
 "[r14+rdi*8]": 35,
 "[rbx+rcx*4]": 473,
 "[r15-7]": 35,
 "[rsi-7]": 84,
 "[r15+rax*2-4]": 2,
 "[rcx+r10*4]": 137,
 "[r14+reg_base_pointer*8+CONST]": 139,
 "[rsi+r9*2-2]": 24,
 "[reg_base_pointer+rbx*4]": 571,
 "[rcx+r13*2]": 64,
 "[rax+rcx*4+CONST]": 1171,
 "[r15+reg_base_pointer*2]": 82,
 "[rdx+rax*2+CONST]": 582,
 "[r13*4+CONST]": 124,
 "[reg_base_pointer+rdx*4]": 630,
 "[reg_base_pointer+r11*8]": 37,
 "[reg_base_pointer+r8*8]": 69,
 "[r10+rdx+CONST]": 249,
 "[r9+rsi*4]": 136,
 "[rdi+rdi+CONST]": 172,
 "[reg_base_pointer+r8*4]": 112,
 "[r8*4+CONST]": 38,
 "[r14-4]": 356,
 "[rbx+r8*2]": 105,
 "[rbx+r12*2]": 139,
 "[reg_base_pointer+r8]": 179,
 "[rcx*8+CONST]": 2252,
 "[rsi*8+CONST]": 339,
 "[rsi+r8+CONST]": 297,
 "[r8*8+CONST]": 80,
 "[reg_base_pointer+reg_base_pointer*2+CONST]": 63,
 "[r12+r13*4]": 278,
 "[r12+rdx*4-4]": 6,
 "[r12+rcx*4]": 456,
 "[r9+rdi*2+CONST]": 14,
 "[r14+rbx*4]": 416,
 "[rdx+rcx*2+CONST]": 138,
 "[rdx+rbx*8+CONST]": 20,
 "[r12+r13]": 872,
 "[r14+r11]": 180,
 "[r13+reg_base_pointer*4+CONST]": 128,
 "[rcx+rax*4-4]": 83,
 "[r12*8+CONST]": 657,
 "[rsi+r12*4]": 83,
 "[r10+rax*8+CONST]": 102,
 "[r8+rbx*8]": 40,
 "[rax+rdx-1]": 184,
 "[r14+r13*2]": 52,
 "[rdi*4+CONST]": 72,
 "[rdi+reg_base_pointer*8]": 283,
 "[r14+reg_base_pointer]": 915,
 "[r8+rax-1]": 61,
 "[r13+r12]": 391,
 "[r14+rsi+CONST]": 186,
 "[r10+rdi]": 239,
 "[rdx+r15*8]": 195,
 "[r12+r13*8]": 402,
 "[r11+rcx+CONST]": 171,
 "[rcx+r12*2]": 56,
 "[r15+r13*8]": 206,
 "[rcx+rcx]": 2627,
 "[rdx+reg_base_pointer]": 611,
 "[rdi+reg_base_pointer]": 670,
 "[reg_base_pointer+r15*8]": 229,
 "[r10-8]": 282,
 "[reg_base_pointer+r13+CONST]": 415,
 "[reg_base_pointer+r11+CONST]": 122,
 "[r11+r14+CONST]": 52,
 "[r9+rdi]": 365,
 "[rdx+r13*4]": 175,
 "[rax+r12*2]": 269,
 "[rcx+r10*8]": 64,
 "[r11+r10]": 384,
 "[r15+r14]": 536,
 "[rcx+r14*8]": 235,
 "[r12-3]": 262,
 "[r15+r8]": 206,
 "[r9+r8+CONST]": 283,
 "[r10+r15+CONST]": 38,
 "[r13+r9*8]": 38,
 "[r12+r9*4]": 106,
 "[r8-4]": 378,
 "[rcx-8]": 1360,
 "[r11+rax*4]": 755,
 "[r12+reg_base_pointer+CONST]": 429,
 "[reg_base_pointer+rax*8+CONST]": 712,
 "[reg_base_pointer+r12*8+CONST]": 433,
 "[r8+rdx*2]": 315,
 "[rcx+rbx*2]": 247,
 "[r15+r12*2]": 31,
 "[reg_base_pointer+rcx*2+CONST]": 63,
 "[rdi+r10*8]": 87,
 "[rdx+r10+CONST]": 135,
 "[rcx+r8*2+CONST]": 49,
 "[rcx+r8*2]": 150,
 "[r11+rax*8+CONST]": 105,
 "[rdx+rcx-2]": 109,
 "[r13+rcx-1]": 36,
 "[reg_stack_pointer+rsi+CONST]": 327,
 "xchg": 3725,
 "[rdx+rax-1]": 341,
 "[rdi+rax*8-8]": 55,
 "[rbx*4+CONST]": 607,
 "[rcx*4]": 1059,
 "[rcx+rsi-1]": 61,
 "bswap": 16604,
 "[reg_base_pointer+r13*8+CONST]": 60,
 "[rdi+rcx*8+CONST]": 320,
 "[rsi+rcx*8+CONST]": 219,
 "[rax+rbx*8+CONST]": 158,
 "[rsi+r9*8]": 69,
 "[reg_base_pointer+r12*2+CONST]": 23,
 "[rbx+r12]": 1100,
 "[r13+r8]": 176,
 "[r12+r12*2]": 934,
 "[rax+r11*8+CONST]": 11,
 "[rbx+r12+CONST]": 628,
 "[r12+r15*4]": 175,
 "[r11+rax+CONST]": 407,
 "xmm10": 23620,
 "xmm8": 29945,
 "xmm9": 25776,
 "[r11+r9*4]": 152,
 "[r13+r15*8+CONST]": 116,
 "[r8+r11*8+CONST]": 2,
 "[r12+r11*8+CONST]": 4,
 "[r8+rcx*4]": 383,
 "[rdx+rbx*4]": 530,
 "[reg_base_pointer+rax*8-8]": 96,
 "[reg_base_pointer+rdx*8-8]": 1,
 "[r15+r14*4]": 381,
 "[r14+r14]": 1187,
 "[reg_base_pointer+r9*4]": 92,
 "[rbx+r9*4]": 117,
 "[reg_base_pointer+rsi*2]": 127,
 "[r12+r15*2]": 96,
 "[rcx+rsi*2]": 329,
 "[rbx+rsi*4]": 268,
 "[r15+r8*4]": 119,
 "[rcx+r14*4]": 187,
 "[rdx+r9*2]": 133,
 "[r14+rcx*4]": 303,
 "[r13-4]": 303,
 "[r15+r9+CONST]": 108,
 "[reg_stack_pointer+rsi*8+CONST]": 182,
 "[r9+rdi*8]": 56,
 "[r12+r14*2]": 89,
 "[r10+r9*8]": 57,
 "[r11+rdx*8]": 81,
 "[r10+r13*8]": 21,
 "[rcx+r13*8]": 178,
 "[rdx+r9]": 474,
 "[rdx+r13*2]": 72,
 "[r9+rbx*4]": 114,
 "[r8+rsi]": 496,
 "[rdx+r12*4]": 193,
 "[rsi+r15*8]": 123,
 "[r15+rbx*8]": 983,
 "[rdx+rsi]": 1444,
 "[reg_base_pointer+r13]": 447,
 "[rdx-6]": 136,
 "[rcx+rdx*8+CONST]": 561,
 "[rbx-7]": 106,
 "[rcx-4]": 918,
 "[r12+rcx-2]": 25,
 "[rax-3]": 945,
 "[rax+rax*4]": 5875,
 "[rax-7]": 262,
 "[rbx+r12*4]": 325,
 "[r11+r8*4]": 100,
 "[r8+rsi+CONST]": 265,
 "[r14+r13+CONST]": 370,
 "[rax+rdi*2]": 229,
 "[reg_base_pointer+r12-1]": 51,
 "[r8+r10]": 437,
 "[rsi+r10]": 433,
 "[rdx+r11*2]": 61,
 "[rdx+r10*2]": 164,
 "[rax+rdi*2+CONST]": 94,
 "[rsi+rdi]": 1072,
 "[rsi+rax-1]": 202,
 "[reg_base_pointer+r14*4]": 186,
 "[rdx+r10*8]": 110,
 "[rax-5]": 270,
 "[rcx+rdi-CONST]": 12,
 "[r15+r12*8]": 335,
 "[reg_base_pointer+r13*8]": 229,
 "[reg_base_pointer+r13*4]": 396,
 "[r10+rdx*2]": 225,
 "[rdx+rbx*2]": 157,
 "[reg_base_pointer+rdx*2]": 250,
 "[r12+reg_base_pointer-1]": 33,
 "[reg_base_pointer+reg_base_pointer*8]": 725,
 "[r13+r15-8]": 8,
 "[rax+rdi-CONST]": 71,
 "[r14+rdi]": 285,
 "[rdx-3]": 405,
 "[r12+r12*8]": 224,
 "[rax+r12-1]": 76,
 "[r15+r14-8]": 13,
 "[r14-8]": 459,
 "[r9+reg_base_pointer]": 214,
 "[r9+r10+CONST]": 231,
 "[rdx+r9+CONST]": 210,
 "[r9+rdi+CONST]": 162,
 "[r12+r14+CONST]": 440,
 "[r9+r8*8]": 70,
 "[r15+rax*8+CONST]": 649,
 "[rax+rax*8]": 1298,
 "[rsi+r14*4]": 113,
 "[r11+rax*2]": 333,
 "[rax+rbx-CONST]": 75,
 "[rdx+rbx+CONST]": 385,
 "[rcx+rbx+CONST]": 347,
 "[rax+r10*4]": 356,
 "[r15+r15*2]": 571,
 "[r10+r13*2+CONST]": 2,
 "[rsi+rcx*2+CONST]": 177,
 "[r12+r13+CONST]": 454,
 "[reg_base_pointer+r8-CONST]": 24,
 "[r14+r13*8]": 255,
 "[rax+r12-CONST]": 37,
 "[rsi+rdi*2+CONST]": 54,
 "[rcx+rsi*2+CONST]": 110,
 "[rdi+rax*2-CONST]": 40,
 "[rsi+rbx+CONST]": 242,
 "[reg_base_pointer*4+CONST]": 767,
 "[rax+r9-CONST]": 14,
 "[rax+r15-CONST]": 26,
 "[rdi+r9]": 652,
 "[r14+r12*2]": 65,
 "[reg_base_pointer+r12*4+CONST]": 151,
 "[r14+r12*2+CONST]": 31,
 "[rcx+rdi*4+CONST]": 142,
 "[rcx+rdx*4-4]": 30,
 "[r13+rcx*4+CONST]": 101,
 "[r15+rsi*4+CONST]": 215,
 "[reg_stack_pointer+rsi*4+CONST]": 432,
 "[reg_base_pointer+r12*4]": 176,
 "[reg_base_pointer+r12*4-4]": 15,
 "[r8+rdx*4+CONST]": 130,
 "[r8+rsi*4+CONST]": 29,
 "[r12+rdi+CONST]": 172,
 "[rsi+r12-CONST]": 19,
 "[rbx+rdi+CONST]": 423,
 "[r15+rdi]": 262,
 "[r9*4+CONST]": 41,
 "[rcx+rdx*8-8]": 74,
 "[r14+r13]": 685,
 "[reg_stack_pointer+rsi*4]": 36,
 "[r14+rcx-1]": 41,
 "[r13+rbx*8+CONST]": 450,
 "[r8+r8*2]": 539,
 "[r15+r8*4+CONST]": 39,
 "[rcx+rdi]": 796,
 "[rsi+r11*4]": 73,
 "[reg_base_pointer+r13*4+CONST]": 152,
 "[r11+rsi]": 365,
 "[rbx+rdx*8]": 1441,
 "[r12+r11*4+CONST]": 28,
 "[r12+rsi*4+CONST]": 88,
 "[rdi+rdx*4+CONST]": 469,
 "[rbx+rsi*4+CONST]": 390,
 "[r13+r11*4+CONST]": 22,
 "[r13+r14*4+CONST]": 88,
 "[r13+rdi*4+CONST]": 47,
 "[rdi+r15*4+CONST]": 40,
 "[rdi+r15*8+CONST]": 19,
 "[rdi+r14*4+CONST]": 54,
 "[rbx+reg_base_pointer-1]": 60,
 "[r12+r14*4+CONST]": 125,
 "[reg_base_pointer+r14*8]": 538,
 "[rcx+reg_base_pointer*2]": 316,
 "[r15+r14*4+CONST]": 197,
 "[reg_base_pointer-7]": 181,
 "[rdx+r8]": 652,
 "[rdi+r12*8]": 219,
 "[rdi+r13*8]": 98,
 "[r8+r12*8]": 34,
 "[r8+r14]": 296,
 "[r8+r9+CONST]": 191,
 "[rdi+r13+CONST]": 142,
 "[reg_base_pointer+rcx*4+CONST]": 222,
 "[r8+rax*2]": 553,
 "[r9-CONST]": 1041,
 "[rdx+r13+CONST]": 149,
 "[rdx+rsi*2]": 352,
 "[rax+r8*8+CONST]": 30,
 "[rsi+rdi+CONST]": 396,
 "[rcx+rdi*4]": 328,
 "[rdx+rsi*2+CONST]": 109,
 "[rsi+r9*2]": 154,
 "[rdi-6]": 173,
 "[rdi+r8*2+CONST]": 60,
 "[rax+rbx*2+CONST]": 198,
 "[rbx+r9*8]": 38,
 "[r11*8+CONST]": 34,
 "[r12+rsi*4]": 230,
 "[r12+rdi*4]": 127,
 "[reg_base_pointer+rsi*4]": 204,
 "[r15+r9*8]": 16,
 "[reg_stack_pointer+r8*4]": 19,
 "[r13+r14]": 566,
 "[rdi+r13]": 480,
 "[r15+rax*4-4]": 19,
 "[rsi+r13*8]": 70,
 "[r14+rax-1]": 104,
 "[r14+reg_base_pointer+CONST]": 411,
 "[rcx+r13*4]": 124,
 "[r13+reg_base_pointer]": 624,
 "[r14*8+CONST]": 229,
 "[reg_base_pointer*8+CONST]": 1221,
 "[r12+rdi*4+CONST]": 127,
 "[reg_base_pointer+rdi*4+CONST]": 87,
 "[r11+rcx*8]": 92,
 "[r15*4+CONST]": 86,
 "[r13+rdx*4-4]": 11,
 "[r12+rdx-4]": 27,
 "[r10*8+CONST]": 41,
 "[reg_stack_pointer+r10*4+CONST]": 121,
 "[rbx+rax*4-4]": 59,
 "[r12+rsi]": 462,
 "[r12+r9]": 188,
 "[r10+rcx*4]": 249,
 "[rsi+r8*4]": 231,
 "[rcx+r9]": 677,
 "[r9+r10]": 349,
 "[rsi+r8*4+CONST]": 81,
 "[rcx-9]": 107,
 "[r8+rsi-1]": 10,
 "[r14+rcx-2]": 10,
 "[r15+rdx*2+CONST]": 66,
 "[rdi+rax-1]": 191,
 "[r10+rcx]": 692,
 "[r10+r8]": 312,
 "[r8+r9*8-CONST]": 1,
 "[rsi+rsi*8]": 167,
 "[r13+r13*8]": 80,
 "[r13+r12*8]": 353,
 "[rax+reg_base_pointer*2+CONST]": 163,
 "cvttss2si": 6037,
 "xmm11": 19826,
 "xmm13": 16597,
 "xmm14": 16947,
 "xmm12": 17860,
 "[r15+r12*4+CONST]": 81,
 "[reg_base_pointer+r14+CONST]": 489,
 "[r13+rax-CONST]": 39,
 "[r15-4]": 451,
 "[rdx+rdx*8+CONST]": 7,
 "[rdx+rdx-1]": 71,
 "[rax+r15*2+CONST]": 68,
 "[rcx+rdi*2+CONST]": 47,
 "[rbx+rsi+CONST]": 543,
 "[r10+r13]": 292,
 "btr": 106,
 "[rbx-6]": 184,
 "[r14-6]": 53,
 "[rbx-9]": 143,
 "[r13+r15]": 532,
 "[r9+rdx*4]": 327,
 "[r10+rdx*4]": 285,
 "[r13+r10]": 178,
 "[r14+r10*8]": 31,
 "[r10+rax*2]": 385,
 "[reg_stack_pointer+reg_base_pointer*8+CONST]": 453,
 "[reg_base_pointer+rdx-1]": 31,
 "[rbx+rbx+CONST]": 155,
 "[r14+rsi]": 506,
 "[reg_base_pointer+rdx*4-4]": 6,
 "[rdx+r8*8]": 155,
 "xmm15": 14241,
 "[rsi+r9]": 633,
 "[r9+rdx+CONST]": 383,
 "[r11+r14*2+CONST]": 2,
 "[rcx+reg_base_pointer*4]": 263,
 "[rbx+rdx*2]": 333,
 "[r14+rcx*2]": 144,
 "[rbx+rcx*2]": 272,
 "[rbx+rax*2]": 841,
 "[r12+r9*8]": 31,
 "[r13+r9*4]": 113,
 "[rdi+r10*2]": 342,
 "[r8+rsi*4]": 185,
 "[r8+rdi*2+CONST]": 56,
 "[rsi-3]": 293,
 "[reg_base_pointer+rdi*4]": 149,
 "[r15+rdi*2]": 63,
 "[rdi+rbx*2]": 157,
 "[r9+rax*2]": 454,
 "[reg_stack_pointer+r12*4+CONST]": 174,
 "[r10+rsi*2]": 73,
 "[r13+r10*2]": 50,
 "[r8+rsi*2]": 172,
 "[rcx+rdi*2]": 213,
 "[r12+rax-4]": 83,
 "[r13-6]": 73,
 "[rax+r13*2+CONST]": 100,
 "[r14+reg_base_pointer*4+CONST]": 104,
 "[rdi+r9-1]": 17,
 "[r10+r8-1]": 5,
 "[rbx+r13]": 1045,
 "[rsi+r12*2]": 34,
 "[r10+r11*8]": 45,
 "[rdi+rdi*2]": 752,
 "[r9-4]": 328,
 "[r15+r15+CONST]": 40,
 "[rdi+r8*4]": 265,
 "[rsi+rdi*4]": 350,
 "[r12+rbx-1]": 68,
 "[rbx+r14*4+CONST]": 321,
 "[reg_base_pointer+rbx*2+CONST]": 147,
 "[r11+r15*2]": 28,
 "[rbx+r14*2+CONST]": 74,
 "[rbx+r13*2+CONST]": 53,
 "[r10+rax*2+CONST]": 63,
 "[r15+rdi*8]": 37,
 "[r13*8+CONST]": 130,
 "[r15+rcx*8+CONST]": 164,
 "[r13+rsi*8]": 143,
 "[reg_stack_pointer+rax*8]": 220,
 "[rax+r15-1]": 46,
 "cmpnlesd": 551,
 "[reg_stack_pointer+r9+CONST]": 132,
 "[rsi*4+CONST]": 90,
 "[rsi+r10*4+CONST]": 62,
 "[r8+r10*4]": 88,
 "[rdi+r15*8]": 52,
 "[rax+r11*2+CONST]": 27,
 "[r10+r9*2+CONST]": 39,
 "[rdx+r12*2+CONST]": 25,
 "[rax+r9*4+CONST]": 68,
 "[rdi+rsi*2+CONST]": 137,
 "[r11+reg_base_pointer*2]": 37,
 "[rdx+rcx-4]": 83,
 "[r9+r10*4]": 140,
 "[r15+rsi*2+CONST]": 26,
 "[rsi+r8*2+CONST]": 39,
 "[rdx*8-CONST]": 15,
 "[r9+rcx-4]": 11,
 "[r9+rcx-5]": 1,
 "[rax+rdi+CONST]": 416,
 "[r9-8]": 181,
 "[rax*8-CONST]": 65,
 "[rbx*8-CONST]": 6,
 "[rdx+r8-5]": 2,
 "[rcx*8-CONST]": 18,
 "[rsi*8-CONST]": 7,
 "[reg_base_pointer*8-CONST]": 17,
 "[rax+rdi-1]": 54,
 "[rbx+r14-1]": 53,
 "[rdi+r13*8+CONST]": 36,
 "[rdi+rcx*8-CONST]": 3,
 "[r14+r14-1]": 18,
 "[reg_base_pointer+reg_base_pointer-1]": 40,
 "[r12+r11]": 146,
 "[r15+r9*4+CONST]": 35,
 "[rdi+r13*4]": 143,
 "[r13+r9]": 138,
 "[r11+rsi*4]": 137,
 "[rsi+rax*4-4]": 85,
 "[r10*8]": 239,
 "[r12+r13*8+CONST]": 72,
 "[r12+rsi*8+CONST]": 42,
 "[rdi+r14*4]": 217,
 "[r9+r10*2]": 111,
 "[rsi+reg_base_pointer*2+CONST]": 43,
 "[rsi+reg_base_pointer*4+CONST]": 38,
 "[rbx+r10*8]": 47,
 "[rbx-5]": 95,
 "[rdx+rcx*4-4]": 31,
 "[rdx+r14*2]": 89,
 "[rdi+r8*8+CONST]": 74,
 "[r11*4]": 256,
 "[r10+rbx]": 255,
 "[r10+rbx+CONST]": 92,
 "[reg_base_pointer+r15*8+CONST]": 84,
 "[rcx+rdx*2+CONST]": 403,
 "[rax+r12*4+CONST]": 74,
 "[r14+reg_base_pointer*4]": 290,
 "[rdi+rsi*2]": 374,
 "[rdi+r8*2]": 278,
 "[rdi+r9*2]": 226,
 "[rsi+r8*2]": 217,
 "[rsi+r9*4]": 168,
 "[rax+r9*4]": 392,
 "[r14-2]": 402,
 "[r8-9]": 30,
 "[r8+rdi*2]": 46,
 "[r11+r10*8]": 52,
 "[r11+r9*8]": 55,
 "[rcx-5]": 107,
 "[r15+rbx-1]": 36,
 "[rcx+r9*8]": 36,
 "[rdx+rcx-6]": 1,
 "[reg_base_pointer+rsi*8]": 341,
 "[rsi+rcx-1]": 79,
 "[r12+rcx*8]": 313,
 "[r12+reg_base_pointer*8+CONST]": 462,
 "[r8+rdi+CONST]": 238,
 "[rcx+r8+CONST]": 204,
 "[rdi+rbx+CONST]": 277,
 "[rcx+rcx*2]": 5681,
 "[rax+reg_base_pointer*8+CONST]": 162,
 "[rdi+r9+CONST]": 237,
 "[reg_base_pointer+rax-8]": 171,
 "[reg_base_pointer+reg_base_pointer*2]": 2016,
 "[reg_base_pointer+r13-CONST]": 30,
 "[reg_base_pointer+r12-CONST]": 38,
 "[reg_base_pointer+r10]": 186,
 "[r15+r10]": 128,
 "[rsi+r11]": 321,
 "[r11+reg_base_pointer]": 224,
 "[r11+r14-1]": 1,
 "[r11+r14-3]": 1,
 "[r11+r14-5]": 1,
 "[r11+r14-7]": 1,
 "[r11+r15-1]": 1,
 "[r11+r15-3]": 1,
 "[r8+r15-2]": 1,
 "[r8+r15-4]": 2,
 "[rbx+rax-2]": 66,
 "[r8+reg_base_pointer]": 238,
 "[r8+r15-1]": 2,
 "[r8+r15-3]": 1,
 "bsr": 3314,
 "[arm_r7,arm_r3]": 4807,
 "emms": 1025,
 "[rax+r8*4+CONST]": 58,
 "[rax+rbx-1]": 98,
 "[r9+r9*2]": 520,
 "[rax+rcx*8-8]": 100,
 "[r8+r12-1]": 2,
 "[rcx+r8*4]": 227,
 "[r10+rsi]": 370,
 "[r11+r8*8]": 64,
 "[rax+rcx-4]": 93,
 "[rsi+rsi*2]": 1471,
 "mm3": 15996,
 "movd": 13863,
 "mm0": 17296,
 "mm1": 16082,
 "punpcklbw": 4678,
 "mm7": 16552,
 "pshufw": 383,
 "psubw": 5542,
 "pmullw": 2650,
 "psllw": 1242,
 "paddw": 9431,
 "[r10+r10*2]": 613,
 "[reg_base_pointer+rdx*2+CONST]": 87,
 "[r13+rdi*4]": 223,
 "[r13+rdi*2]": 36,
 "[r13+rdi*2+CONST]": 13,
 "[r8+r10+CONST]": 78,
 "[reg_base_pointer+rdi*2]": 53,
 "[reg_stack_pointer+r9*4+CONST]": 201,
 "[rsi+r12]": 389,
 "[r12+rdi*2]": 64,
 "[r8+rdi*8]": 100,
 "[r9+r11*2]": 79,
 "[r8+rdi*8+CONST]": 17,
 "[r12+r13*2]": 52,
 "[r13+reg_base_pointer*2]": 115,
 "[r13+r12*2]": 73,
 "[r10+r11+CONST]": 256,
 "[rsi+reg_base_pointer*2]": 106,
 "[rbx+reg_base_pointer*4]": 426,
 "[rdi+r8-CONST]": 15,
 "[r14+reg_base_pointer*2]": 72,
 "[r11+rbx]": 274,
 "[rcx+r9*2]": 83,
 "[rcx+r10*2]": 144,
 "[r11+r10*4]": 141,
 "[r11+r10*4+CONST]": 71,
 "[r8+r11*8]": 20,
 "[r9+r11*8]": 39,
 "[r10+rdi*4]": 87,
 "[r10+rdi*4+CONST]": 22,
 "[r10+r10]": 489,
 "[rdi+r11*2]": 157,
 "[rcx+r10]": 551,
 "[r11+r11]": 453,
 "[rbx+r10*2]": 40,
 "[r12+r15-CONST]": 28,
 "[rcx+r9-CONST]": 6,
 "[r11+r10+CONST]": 301,
 "[r13+r15-CONST]": 18,
 "[rdi+reg_base_pointer*2]": 104,
 "[rdi+r10-CONST]": 4,
 "[rsi+rdi*2]": 203,
 "[rbx+r9*2]": 96,
 "[rax+r10*2]": 145,
 "[rax+r8-CONST]": 28,
 "[rsi+rdx*2+CONST]": 153,
 "[rax+rcx-CONST]": 107,
 "[rax+r11*2]": 100,
 "[r11+rax*4+CONST]": 245,
 "[rsi+r11*2]": 106,
 "[r9+reg_base_pointer*8]": 27,
 "[r8+reg_base_pointer*2]": 47,
 "[r12+r10*4]": 78,
 "[r12+r10*4+CONST]": 28,
 "[rsi+rbx*2]": 130,
 "[rdi+r11*8]": 79,
 "[rdi+r8*4+CONST]": 169,
 "[r11+rbx*4]": 106,
 "[rcx+r10*8+CONST]": 38,
 "[r14+r10*4]": 56,
 "[r13+r10*4]": 159,
 "[rbx+r15*4]": 226,
 "[r13+r11*4]": 62,
 "[r12+r11*4]": 61,
 "[r8+rcx*4+CONST]": 112,
 "[r9+rcx*8+CONST]": 17,
 "[r9+r12*8]": 32,
 "[r8+r12*2]": 23,
 "[reg_base_pointer+r10*4]": 83,
 "[reg_base_pointer+r11*4]": 59,
 "[r15+rbx*8+CONST]": 272,
 "[rdi+rbx*8]": 240,
 "[r11-6]": 43,
 "[r11-5]": 25,
 "[r11-4]": 160,
 "[r12+r10]": 205,
 "[r11-3]": 55,
 "[r11-2]": 178,
 "[rbx+r10]": 269,
 "[r11+rcx*2]": 157,
 "[r10+rcx*2]": 188,
 "[r9-5]": 43,
 "[r9-3]": 154,
 "[r9+r8*2]": 203,
 "[r11+r10*2]": 116,
 "[r10+rdx*8+CONST]": 43,
 "[r9+rdx*8+CONST]": 29,
 "[r10+rbx*8+CONST]": 13,
 "[r10+rbx*8]": 37,
 "[r12+r11*2]": 36,
 "[r12+r8*2]": 57,
 "[r14+r8*8]": 46,
 "[r15+r8*2]": 29,
 "[r15+rbx*2]": 146,
 "[rbx+r10*8+CONST]": 31,
 "[r14+rbx*2]": 178,
 "[r15+r11*2]": 25,
 "[r14+r8*2]": 40,
 "[rdi+r11*8+CONST]": 12,
 "[r14+r11*2]": 32,
 "[r9+r8*4+CONST]": 102,
 "[rbx+r11+CONST]": 352,
 "[rdi+r10*4+CONST]": 235,
 "[rbx+r8*8]": 79,
 "[r14+r10*2]": 40,
 "[reg_base_pointer+r11]": 152,
 "[rbx+r11*2]": 83,
 "[rbx+r11*8]": 33,
 "[r11+r12*8]": 21,
 "[r11+rsi*8]": 71,
 "[r11+r12*8+CONST]": 6,
 "[r11+rsi*8+CONST]": 15,
 "[r15+r10*2]": 27,
 "[r11+rax*8]": 216,
 "[r15+rcx*2]": 122,
 "[r10+r8+CONST]": 150,
 "[r9+rdx*4+CONST]": 146,
 "[r14+r10]": 233,
 "[rdi+reg_base_pointer*8+CONST]": 45,
 "[rdi+reg_base_pointer*4+CONST]": 103,
 "[r13+r11]": 137,
 "[r9+rdx*2+CONST]": 31,
 "[rbx+r8]": 316,
 "[r11+r12]": 410,
 "[r15+rsi*2]": 87,
 "[rbx+r9+CONST]": 200,
 "[rdi+rbx*8+CONST]": 87,
 "[rdi+rbx*4+CONST]": 149,
 "[r11+rdx*2]": 223,
 "[r8+rbx*2]": 71,
 "[r12+rcx*2]": 170,
 "[r8+rax-CONST]": 92,
 "[r9+rcx*4+CONST]": 133,
 "[r8+r11*2]": 73,
 "[rax*4-CONST]": 86,
 "[r13+r11*2]": 30,
 "[r9+r11*4+CONST]": 16,
 "[r9+r11*4]": 85,
 "[rcx+rax-CONST]": 275,
 "[r11+rcx-CONST]": 20,
 "[r13+rsi*2]": 63,
 "[rbx+rsi*2]": 206,
 "[r11+rsi*2]": 74,
 "[r9+rsi*4+CONST]": 77,
 "[r10+rbx*2]": 174,
 "[r11+rbx*2]": 84,
 "[r9+rbx*4+CONST]": 75,
 "[reg_base_pointer+rbx*2]": 277,
 "[r12+rbx*2]": 185,
 "[reg_base_pointer+r8*2]": 85,
 "[r13+r8*2]": 35,
 "[r11+r8*2]": 75,
 "[rcx+r9+CONST]": 155,
 "[reg_base_pointer+r9+CONST]": 118,
 "[rsi+rdx-CONST]": 175,
 "[rsi+rcx-CONST]": 72,
 "[rdx+rsi-CONST]": 42,
 "[rax+r8*2]": 269,
 "[rcx*4-CONST]": 6,
 "[r9+rcx-CONST]": 35,
 "[r9+rsi-CONST]": 35,
 "[r13+r9-CONST]": 11,
 "[rsi+rax-CONST]": 105,
 "[r8+rsi-CONST]": 14,
 "[r8+rbx+CONST]": 81,
 "[r9+r8-CONST]": 14,
 "[rsi+r9+CONST]": 326,
 "[r8+rcx-CONST]": 44,
 "[r13+r8-CONST]": 8,
 "[r9*4]": 512,
 "[r9+rax*2+CONST]": 73,
 "[r10+rdi*2+CONST]": 9,
 "[r15+r12*8+CONST]": 87,
 "[rdi+r12*8+CONST]": 43,
 "[rdi+r12*4]": 178,
 "[rcx+rdx-CONST]": 156,
 "[rsi+r15*4]": 128,
 "[rdi+r15*4]": 120,
 "[rax+r15*8+CONST]": 95,
 "[r12+reg_base_pointer*4]": 357,
 "[rdi+reg_base_pointer*4]": 241,
 "[rsi+r12*8+CONST]": 5,
 "[rax+r14*8+CONST]": 104,
 "[rdi+r14]": 621,
 "[rdi+r14*8]": 141,
 "[rsi+r14*8+CONST]": 84,
 "[rdi+r14*8+CONST]": 101,
 "[rsi+r14*8]": 71,
 "[rax+r13*8+CONST]": 82,
 "[r15+r13*8+CONST]": 109,
 "[r15+reg_base_pointer*8+CONST]": 91,
 "[rdi+rbx*4]": 528,
 "[r10+r14]": 322,
 "[rsi+r13*4]": 95,
 "[r9+r13*4]": 48,
