{
 "CONST": 111375997,
 "mov": 59635715,
 "eax": 24503310,
 "$v0": 19713211,
 "$t9": 17129273,
 "move": 16283033,
 "ldr": 15949768,
 "CONST($sp)": 15158866,
 "add": 14871765,
 "lw": 14475515,
 "arm_r3": 13598695,
 "call": 12633789,
 "[reg_base_pointer-CONST]": 12633281,
 "$a0": 12271901,
 "x0": 12169164,
 "arm_r0": 11903369,
 "bl": 11804776,
 "ld": 11688647,
 "[reg_stack_pointer,CONST]": 10518229,
 "reg_stack_pointer": 10448624,
 "push": 10132754,
 "[reg_stack_pointer+CONST]": 9590490,
 "cmp": 8393311,
 "rax": 7957906,
 "addiu": 7574885,
 "reg_base_pointer": 7176791,
 "$at": 7069080,
 "$a1": 6875176,
 "arm_r2": 6833503,
 "-CONST($gp)": 6705766,
 "b": 6638989,
 "edx": 6623027,
 "w0": 6601748,
 "nop": 6489402,
 "lea": 6431783,
 "esi": 6339424,
 "arm_r1": 6303053,
 "jalr": 6264952,
 "$s0": 6216062,
 "$gp": 6099426,
 "rdi": 6046726,
 "str": 5931786,
 "sub": 5902088,
 "$zero": 5505997,
 "ecx": 5411406,
 "sw": 4843045,
 "x1": 4790078,
 "$s1": 4763613,
 "$v1": 4760371,
 "edi": 4683319,
 "$sp": 4564347,
 "ebx": 4499367,
 "daddiu": 4478057,
 "jmp": 4349914,
 "pop": 4315270,
 "$s2": 3907064,
 "arm_r4": 3759257,
 "CONST($fp)": 3686361,
 "sd": 3521437,
 "$a2": 3481327,
 "test": 3368787,
 "je": 3361226,
 "[reg_base_pointer,-CONST]": 3357516,
 "$s3": 3335174,
 "[reg_stack_pointer]": 3292343,
 "arm_r5": 3092609,
 "-CONST": 2983778,
 "bal": 2899793,
 "al": 2890554,
 "w1": 2882312,
 "$s4": 2728333,
 "x19": 2683747,
 "movz": 2657770,
 "x2": 2610559,
 "rsi": 2598280,
 "arm_r6": 2596344,
 "rbx": 2577331,
 "rdx": 2480795,
 "jne": 2241090,
 "beqz": 2223094,
 "$s5": 2213549,
 "arm_r7": 2158097,
 "xor": 2153538,
 "beq": 2129550,
 "$ra": 2125602,
 "x20": 2092047,
 "[reg_base_pointer+CONST]": 1814166,
 "$s6": 1790835,
 "[reg_pc,CONST]": 1731902,
 "$fp": 1697797,
 "x21": 1655708,
 "sb": 1642818,
 "arm_r8": 1638970,
 "bne": 1607593,
 "r12": 1589756,
 "CONST($gp)": 1583044,
 "x29": 1571280,
 "and": 1542485,
 "ldp": 1531133,
 "$s7": 1489405,
 "x8": 1467812,
 "rcx": 1467074,
 "r14": 1452068,
 "ret": 1433832,
 "adrp": 1421238,
 "lui": 1416013,
 "$a3": 1401130,
 "CONST($s0)": 1389770,
 "x22": 1327286,
 "stp": 1323450,
 "movzx": 1282908,
 "w8": 1251859,
 "bnez": 1248363,
 "[reg_pc+CONST]": 1244436,
 "r13": 1238240,
 "[eax+CONST]": 1235295,
 "r15": 1234740,
 "w2": 1209923,
 "-CONST($s0)": 1194121,
 "lr": 1189745,
 "sl": 1149384,
 "[rax+CONST]": 1087016,
 "ldrb": 1028898,
 "[x0,CONST]": 1021010,
 "x23": 1007064,
 "reg_pc": 985143,
 "x3": 972984,
 "CONST($v0)": 886471,
 "[x29,-CONST]": 870147,
 "x30": 849216,
 "($v0)": 840150,
 "lsl": 831572,
 "ip": 803864,
 "b.eq": 795011,
 "lsl CONST": 790619,
 "jr": 786241,
 "x24": 779951,
 "[rbx+CONST]": 777695,
 "addu": 755573,
 "[esi+CONST]": 752911,
 "[eax]": 749078,
 "daddu": 697115,
 "[x19,CONST]": 694974,
 "[x0]": 694237,
 "cbz": 678362,
 "[arm_r4,CONST]": 672055,
 "[arm_r3,CONST]": 655703,
 "[rax]": 644726,
 "[ebx-CONST]": 636279,
 "w3": 628695,
 "xmm0": 628641,
 "b.ne": 615771,
 "x25": 613473,
 "w9": 605641,
 "[arm_r3]": 601592,
 "sll": 578110,
 "x9": 577959,
 "shl": 560673,
 "ldur": 555411,
 "jal": 525442,
 "lbu": 520819,
 "$t0": 517204,
 "r12d": 517039,
 "w19": 504083,
 "strb": 486106,
 "x26": 484813,
 "CONST($s1)": 474050,
 "w20": 465345,
 "x4": 458131,
 "or": 453578,
 "orr": 444845,
 "r8d": 444761,
 "[edi+CONST]": 443750,
 "w21": 414049,
 "w4": 409961,
 "r14d": 401791,
 "wzr": 400977,
 "cl": 398200,
 "x27": 387331,
 "r13d": 379936,
 "movsxd": 379915,
 "r8": 379276,
 "andi": 378706,
 "imul": 373450,
 "[ebx+CONST]": 366628,
 "subs": 357890,
 "jle": 350961,
 "w22": 347465,
 "sltu": 343906,
 "[reg_base_pointer-8]": 341909,
 "r15d": 341786,
 "xzr": 338812,
 "[arm_r0,CONST]": 338101,
 "cbnz": 328332,
 "x28": 325340,
 "sar": 318108,
 "stur": 311874,
 "endbr32": 301002,
 "$t1": 300626,
 "tst": 299104,
 "endbr64": 298013,
 "shr": 297898,
 "[x20,CONST]": 296801,
 "CONST($at)": 295849,
 "w5": 295700,
 "w10": 294421,
 "[reg_stack_pointer,-CONST]": 293078,
 "xmm1": 291941,
 "[arm_r5,CONST]": 290782,
 "lsr": 290774,
 "($sp)": 290737,
 "-CONST($at)": 288662,
 "r9d": 286852,
 "asr": 282956,
 "CONST($a0)": 281786,
 "[rdi+CONST]": 281053,
 "w23": 280784,
 "dsll": 276400,
 "[ecx+CONST]": 269547,
 "x5": 267929,
 "d0": 267315,
 "j": 261658,
 "mul": 258272,
 "x10": 252964,
 "[esi]": 251429,
 "[edx+CONST]": 249368,
 "dl": 247971,
 "($s0)": 243611,
 "gs:[CONST]": 235151,
 "w24": 231987,
 "fstp": 230868,
 "CONST($s2)": 230862,
 "ldrh": 229157,
 "[arm_r0]": 227445,
 "[x8,CONST]": 227094,
 "fs:[CONST]": 224051,
 "fld": 223912,
 "ax": 223368,
 "eor": 223346,
 "w6": 221253,
 "$f0": 219768,
 "ldm": 213977,
 "r9": 213179,
 "tbnz": 211298,
 "movsd": 209939,
 "sltiu": 206562,
 "bx": 205417,
 "[x1,CONST]": 202962,
 "[r12+CONST]": 202479,
 "[r14+CONST]": 196753,
 "inc": 195976,
 "movsx": 194714,
 "[r15+CONST]": 193739,
 "$t2": 192517,
 "sxtw": 191578,
 "w25": 190774,
 "($s1)": 189808,
 "movn": 188023,
 "tbz": 183263,
 "jg": 179447,
 "w7": 178842,
 "ja": 178481,
 "x6": 176911,
 "s0": 171123,
 "ori": 170283,
 "[arm_r6,CONST]": 169647,
 "subu": 169633,
 "strh": 166678,
 "CONST($v1)": 165940,
 "[r13+CONST]": 163344,
 "slt": 162252,
 "[x21,CONST]": 161912,
 "jbe": 161361,
 "r10d": 160903,
 "[reg_base_pointer,CONST]": 158158,
 "CONST($s3)": 157196,
 "w11": 157186,
 "js": 155804,
 "[CONST]": 154276,
 "[rbx]": 153668,
 "($at)": 153351,
 "st(1)": 152935,
 "w26": 152489,
 "[ecx]": 152083,
 "[arm_r2,arm_r3]": 150714,
 "[reg_base_pointer]": 149355,
 "[x19]": 148761,
 "b.le": 148505,
 "mvn": 146886,
 "[edx]": 146111,
 "ldrsw": 145380,
 "xmm2": 144738,
 "[arm_r1,CONST]": 144634,
 "jae": 142936,
 "($s2)": 142874,
 "dext": 140209,
 "x11": 140137,
 "[rcx+CONST]": 137801,
 "movk": 137709,
 "[arm_r2,CONST]": 133903,
 "$t3": 133336,
 "w27": 132922,
 "[arm_r4]": 130058,
 "lb": 129517,
 "cdqe": 127720,
 "r11d": 127021,
 "csel": 126595,
 "x7": 125703,
 "ldrsh": 125465,
 "[reg_base_pointer-4]": 125347,
 "[rdx+CONST]": 124922,
 "movne": 124788,
 "ble": 123729,
 "d1": 122202,
 "eors": 121306,
 "r10": 120465,
 "($a0)": 119872,
 "[edi]": 118710,
 "b.gt": 116739,
 "[x1]": 116576,
 "blt": 114238,
 "w28": 113615,
 "-CONST($v0)": 113336,
 "[arm_r7,CONST]": 112792,
 "($s3)": 112662,
 "adc": 112385,
 "moveq": 111553,
 "jb": 111439,
 "fmul": 110535,
 "($v1)": 110379,
 "jl": 110043,
 "[x22,CONST]": 109729,
 "lhu": 109550,
 "($fp)": 108540,
 "w12": 108068,
 "lsr CONST": 105996,
 "[arm_r2]": 105607,
 "jge": 105350,
 "[rsi+CONST]": 104593,
 "CONST($s4)": 101239,
 "[x8]": 100411,
 "movss": 98861,
 "srl": 95749,
 "cmn": 95124,
 "ne": 94746,
 "[x20]": 93985,
 "CONST($a1)": 93851,
 "xmm3": 93350,
 "[rdi]": 92393,
 "movabs": 92344,
 "neg": 91919,
 "[arm_r8,CONST]": 90366,
 "ldc1": 90037,
 "x12": 89947,
 "cset": 89641,
 "[x2,CONST]": 87804,
 "not": 87184,
 "blez": 87122,
 "[arm_r5]": 86768,
 "r11": 85733,
 "[sb,CONST]": 85451,
 "$t4": 84462,
 "CONST($s5)": 83985,
 "stm": 82797,
 "CONST($s6)": 82013,
 "b.hi": 81410,
 "blr": 80902,
 "slti": 80768,
 "[eax-CONST]": 80087,
 "eq": 79937,
 "jns": 79656,
 "CONST($s7)": 79361,
 "($s4)": 79054,
 "st(0)": 78374,
 "bgt": 78161,
 "s1": 77727,
 "-CONST($s1)": 77129,
 "dx": 76121,
 "b.lt": 75229,
 "fmov": 74721,
 "bic": 74568,
 "sete": 74272,
 "w13": 73560,
 "[sl,CONST]": 72565,
 "[x23,CONST]": 71364,
 "bltz": 70822,
 "b.ls": 70785,
 "dec": 70239,
 "xmm4": 70223,
 "rsb": 69913,
 "[rdx]": 69699,
 "bge": 69634,
 "[arm_r3,-CONST]": 69262,
 "movaps": 68927,
 "bgtz": 68913,
 "adds": 68275,
 "leave": 67916,
 "[rax+rax]": 66435,
 "pxor": 66075,
 "movups": 65906,
 "sbb": 65724,
 "cdq": 65670,
 "xori": 65134,
 "xmm7": 64565,
 "setne": 64431,
 "[arm_r1]": 64007,
 "xmm5": 63094,
 "fadd": 63013,
 "d8": 62674,
 "[ebx]": 62438,
 "w14": 61823,
 "($s5)": 61736,
 "$t5": 61290,
 "cmove": 60842,
 "[rcx]": 60607,
 "[x21]": 59874,
 "[x24,CONST]": 59522,
 "dsubu": 59471,
 "[reg_pc,-CONST]": 59364,
 "[arm_r6]": 59284,
 "[x9,CONST]": 59245,
 "b.hs": 58857,
 "sh": 58021,
 "b.ge": 57587,
 "[r14]": 57027,
 "[r12]": 56715,
 "xmm6": 56664,
 "x13": 56124,
 "bhi": 56022,
 "asr CONST": 55475,
 "[rsi]": 54948,
 "$f2": 54698,
 "w15": 54463,
 "[x3,CONST]": 53776,
 "blx": 53698,
 "cmovne": 53497,
 "[reg_stack_pointer-CONST]": 53277,
 "($s6)": 52728,
 "[x2]": 51792,
 "$t6": 51506,
 "bls": 51325,
 "mla": 51289,
 "-CONST($v1)": 51183,
 "($a1)": 51112,
 "fxch": 50065,
 "bhs": 49940,
 "[esi-CONST]": 48948,
 "sdc1": 48932,
 "mulsd": 47866,
 "[x25,CONST]": 46530,
 "[r15]": 45490,
 "madd": 45021,
 "w16": 44525,
 "($s7)": 44144,
 "[arm_r7]": 43994,
 "$t7": 43917,
 "idiv": 43854,
 "cx": 43820,
 "d2": 43238,
 "[x22]": 43185,
 "b.lo": 43072,
 "ands": 42880,
 "[x28,CONST]": 42625,
 "ror CONST": 42591,
 "blo": 42489,
 "reg_base_pointerl": 41999,
 "ccmp": 41795,
 "[x26,CONST]": 41780,
 "$f1": 41607,
 "[r13]": 41403,
 "bgez": 41295,
 "[x29,CONST]": 40214,
 "w17": 39856,
 "x14": 39565,
 "$t8": 39508,
 "[x27,CONST]": 38569,
 "ror": 38057,
 "CONST($a2)": 37985,
 "movq": 37700,
 "sra": 37287,
 "rol": 36699,
 "[reg_pc-CONST]": 36656,
 "ldrne": 36539,
 "movapd": 36187,
 "s2": 35783,
 "[ip,CONST]": 35451,
 "addsd": 35277,
 "w18": 35161,
 "q0": 34503,
 "ldrsb": 34356,
 "sil": 34214,
 "ext": 34050,
 "[x4,CONST]": 33556,
 "[arm_r8]": 33429,
 "st(2)": 33426,
 "lh": 31862,
 "[x3]": 31603,
 "lwl": 31564,
 "($a2)": 31452,
 "lwr": 31355,
 "fsub": 31316,
 "movdqa": 30996,
 "$f24": 30829,
 "sbfiz": 30809,
 "x15": 30679,
 "[arm_r2,-CONST]": 30657,
 "[x9]": 30244,
 "[reg_base_pointer-1]": 30177,
 "xmm8": 29945,
 "mulss": 29652,
 "d9": 29624,
 "[sb]": 29477,
 "cmpne": 29454,
 "cs:[rax+rax]": 29271,
 "r14b": 29243,
 "mflo": 28899,
 "sturb": 28739,
 "$f20": 28685,
 "movlt": 28594,
 "fild": 28594,
 "[x23]": 28103,
 "r12b": 28048,
 "movdqu": 27896,
 "mfhi": 27772,
 "scvtf": 27690,
 "fmulp": 27463,
 "rotr": 27207,
 "lwu": 26710,
 "x16": 25886,
 "xmm9": 25776,
 "movge": 25695,
 "[edi-CONST]": 25548,
 "ldurb": 25503,
 "orrs": 25433,
 "[r8+CONST]": 25356,
 "[rax-1]": 25266,
 "es:[edi]": 25185,
 "cvtsi2sd": 24983,
 "[rax*4]": 24871,
 "strne": 24809,
 "$f12": 24763,
 "[eax*4]": 24619,
 "faddp": 24550,
 "v0.16b": 24314,
 "swl": 24104,
 "swr": 24091,
 "r15b": 24063,
 "cmovg": 24054,
 "r13b": 23937,
 "[sl]": 23825,
 "r8b": 23786,
 "fdiv": 23774,
 "xmm10": 23620,
 "[rdx+rax]": 23567,
 "mm6": 23384,
 "-CONST($s2)": 23382,
 "fcmpe": 23148,
 "le": 23137,
 "[ip]": 22509,
 "ldreq": 22462,
 "cwde": 22443,
 "smull": 22296,
 "si": 22245,
 "sdiv": 22188,
 "ubfx": 22093,
 "sxtw CONST": 21783,
 "[x5,CONST]": 21730,
 "cmovle": 21585,
 "d3": 21453,
 "popeq": 21220,
 "[edx-CONST]": 21206,
 "ah": 21160,
 "ubfiz": 21114,
 "fldcw": 21096,
 "[x24]": 21055,
 "sbcs": 20626,
 "[r9+CONST]": 20554,
 "shrd": 20511,
 "sbc": 20249,
 "dil": 20152,
 "vpxor": 19980,
 "xmm11": 19826,
 "x17": 19735,
 "seta": 19649,
 "streq": 19343,
 "addss": 19191,
 "ins": 19174,
 "x[reg_stack_pointer+CONST]": 18963,
 "subsd": 18853,
 "lt": 18778,
 "addne": 18717,
 "s3": 18685,
 "xorps": 18649,
 "div": 18517,
 "umull": 18387,
 "[eax-1]": 18368,
 "[rax+rax*2]": 18336,
 "CONST($a3)": 18315,
 "[lr,CONST]": 18282,
 "mul.d": 18223,
 "[r10+CONST]": 18150,
 "[x4]": 18145,
 "v1.16b": 18124,
 "sdl": 18118,
 "sdr": 18114,
 "ldl": 18058,
 "d10": 18056,
 "xmm12": 17860,
 "[x6,CONST]": 17786,
 "[x10,CONST]": 17749,
 "[arm_r1,arm_r2]": 17520,
 "dsll32": 17460,
 "movlo": 17369,
 "fcvt": 17335,
 "add.d": 17317,
 "mm0": 17296,
 "x18": 17292,
 "divsd": 17284,
 "fldz": 17275,
 "mov.d": 17155,
 "movgt": 17132,
 "CONST.00000000": 17110,
 "w30": 17018,
 "xmm14": 16947,
 "mvnne": 16758,
 "movle": 16718,
 "teq": 16671,
 "bswap": 16604,
 "xmm13": 16597,
 "mm7": 16552,
 "[ecx-CONST]": 16377,
 "-CONST($s3)": 16222,
 "ge": 16203,
 "gt": 16162,
 "cmpeq": 16142,
 "[eax+eax]": 16128,
 "mm1": 16082,
 "mm3": 15996,
 "di": 15816,
 "($a3)": 15673,
 "addeq": 15611,
 "[arm_r0,-CONST]": 15269,
 "st(3)": 15213,
 "mm2": 15164,
 "cvtsi2ss": 15103,
 "[x0,-CONST]": 15001,
 "movhs": 14914,
 "$f4": 14911,
 "dsrl": 14798,
 "ucomisd": 14762,
 "[x25]": 14656,
 "sxth": 14651,
 "[x0,x1,lsl CONST]": 14577,
 "clz": 14387,
 "fst": 14349,
 "xmm15": 14241,
 "comisd": 14150,
 "-CONST($s6)": 13994,
 "cmovs": 13983,
 "mm4": 13870,
 "movd": 13863,
 "[rax*8]": 13771,
 "br": 13633,
 "[eax+edx*4]": 13599,
 "[x1,x0]": 13501,
 "-1": 13487,
 "r9b": 13462,
 "[rax-CONST]": 13456,
 "rev16": 13404,
 "[arm_r1,-CONST]": 13341,
 "-CONST($a1)": 13336,
 "s8": 13296,
 "uxtw CONST": 13111,
 "fcomip": 13093,
 "cmovl": 13083,
 "cmovbe": 13063,
 "d11": 13050,
 "s4": 13026,
 "[eax-4]": 12982,
 "[eax+ecx*4]": 12972,
 "[x26]": 12879,
 "movi": 12791,
 "mm5": 12776,
 "[rax+rdx*8]": 12716,
 "cneg": 12672,
 "[edx+eax]": 12657,
 "fld1": 12571,
 "-CONST($a0)": 12548,
 "mtc1": 12542,
 "dmtc1": 12530,
 "[arm_r3,arm_r2,lsl CONST]": 12494,
 "seb": 12485,
 "sllv": 12456,
 "bt": 12414,
 "[x7,CONST]": 12336,
 "[lr]": 12193,
 "bfi": 12113,
 "[arm_r4,-CONST]": 11984,
 "[r8]": 11982,
 "cmovns": 11976,
 "rev": 11859,
 "ls": 11816,
 "v2.16b": 11696,
 "CONST($t0)": 11667,
 "[r11+CONST]": 11618,
 "-CONST($s4)": 11583,
 "negu": 11568,
 "fistp": 11549,
 "[eax+eax*2]": 11513,
 "d4": 11495,
 "v3.16b": 11488,
 "cvtss2sd": 11429,
 "b.mi": 11412,
 "rep stosd": 11347,
 "addls": 11324,
 "[x5]": 11230,
 "nor": 11199,
 "ymm7": 11175,
 "vpaddd": 11090,
 "$f22": 10981,
 "repe cmpsb": 10940,
 "subss": 10868,
 "paddd": 10828,
 "[arm_r4,arm_r3]": 10676,
 "msub": 10605,
 "[x27]": 10450,
 "adr": 10416,
 "setg": 10391,
 "$f25": 10377,
 "[reg_stack_pointer-8]": 10346,
 "fcmp": 10308,
 "rsblt": 10207,
 "[rax+rcx*8]": 10197,
 "mi": 10128,
 "subne": 10110,
 "asrne": 9999,
 "[x10]": 9907,
 "ldmib": 9863,
 "bmi": 9827,
 "[rdx+rax*8]": 9785,
 "movhi": 9761,
 "q1": 9724,
 "d12": 9711,
 "smaddl": 9667,
 "seh": 9622,
 "udiv": 9532,
 "[rcx+rax]": 9524,
 "jp": 9461,
 "paddw": 9431,
 "[eax+esi*4]": 9390,
 "[rax*8+CONST]": 9389,
 "aese": 9360,
 "rsbs": 9324,
 "dsra": 9248,
 "fabs": 9221,
 "cmovb": 9216,
 "-CONST($fp)": 9155,
 "stmib": 9148,
 "cmova": 9146,
 "umaddl": 9095,
 "setb": 9078,
 "lo": 9070,
 "[x28]": 9040,
 "pand": 9023,
 "[x11,CONST]": 8996,
 "movls": 8993,
 "CONST.0": 8991,
 "multu": 8968,
 "dsrl32": 8954,
 "vpsrld": 8920,
 "[ecx+eax]": 8910,
 "s5": 8901,
 "fcomi": 8889,
 "-CONST($s5)": 8853,
 "[eax-8]": 8853,
 "div.d": 8832,
 "cmovge": 8795,
 "$f26": 8701,
 "[r9]": 8672,
 "fcvtzs": 8649,
 "bics": 8636,
 "shld": 8630,
 "fsubp": 8624,
 "[rax+rcx]": 8570,
 "hi": 8565,
 "[ip,arm_r3]": 8548,
 "($t0)": 8518,
 "[arm_r6,-CONST]": 8511,
 "aesmc": 8430,
 "r10b": 8420,
 "sub.d": 8285,
 "[edx+eax*4]": 8180,
 "x[reg_base_pointer-CONST]": 8158,
 "rep movsd": 8112,
 "[eax+edi*4]": 8008,
 "mfc1": 7968,
 "smlal": 7950,
 "dmult": 7926,
 "st(4)": 7913,
 "-CONST($s7)": 7902,
 "d13": 7877,
 "fnstcw": 7862,
 "por": 7827,
 "[x6]": 7806,
 "ld1": 7707,
 "[arm_r5,-CONST]": 7674,
 "d5": 7652,
 "csinc": 7600,
 "andne": 7572,
 "popne": 7572,
 "[eax*8]": 7569,
 "[rax+rdx]": 7500,
 "$f13": 7448,
 "x[ebx-CONST]": 7412,
 "CONST($t1)": 7386,
 "[rcx-1]": 7382,
 "cvt.d.w": 7334,
 "[edx-1]": 7263,
 "s9": 7171,
 "vmovdqu": 7167,
 "dh": 7124,
 "[ebx+eax*4-CONST]": 7123,
 "vpslld": 7120,
 "lwc1": 7070,
 "[eax+edx*4+CONST]": 6992,
 "bxeq": 6979,
 "[ecx+eax*4]": 6924,
 "fdivp": 6899,
 "[rbx-1]": 6871,
 "[lr,ip]": 6851,
 "s6": 6762,
 "cinc": 6746,
 "[reg_base_pointer-9]": 6744,
 "r8w": 6728,
 "uxtw": 6694,
 "v24.16b": 6639,
 "v5.16b": 6620,
 "[rdx+rax+CONST]": 6599,
 "v4.16b": 6598,
 "[x7]": 6593,
 "[rbx+rax]": 6588,
 "divu": 6556,
 "[rdx+rax*4]": 6491,
 "[x1,-CONST]": 6468,
 "psrld": 6467,
 "[arm_r2,arm_r3,lsl CONST]": 6461,
 "ucvtf": 6427,
 "fucomip": 6422,
 "[rax+rdx*4]": 6396,
 "[r10]": 6392,
 "cvtsd2ss": 6377,
 "[rdx-1]": 6321,
 "[ecx-1]": 6306,
 "[eax+ecx]": 6305,
 "[reg_pc,arm_r1]": 6300,
 "cvttsd2si": 6291,
 "[esi+eax]": 6139,
 "ldrls": 6130,
 "ymm1": 6123,
 "orreq": 6109,
 "[esi-1]": 6108,
 "v8.16b": 6056,
 "r11b": 6054,
 "orrne": 6047,
 "[edx*4]": 6040,
 "cvttss2si": 6037,
 "srlv": 6032,
 "[ecx+edx]": 6012,
 "[edi+eax]": 5991,
 "ymm2": 5979,
 "cqo": 5941,
 "d14": 5935,
 "($t1)": 5928,
 "sync": 5904,
 "[rsi-1]": 5901,
 "d7": 5893,
 "addgt": 5887,
 "xorpd": 5884,
 "[rax+rax*4]": 5875,
 "[rcx+rax*4]": 5863,
 "sturh": 5854,
 "[x8,-CONST]": 5828,
 "d6": 5807,
 "ymm5": 5807,
 "[arm_r6,arm_r3]": 5804,
 "v6.16b": 5767,
 "[ip,-CONST]": 5738,
 "[arm_r1,arm_r3]": 5718,
 "[rbx-CONST]": 5682,
 "[rcx+rcx*2]": 5681,
 "strbne": 5663,
 "ldurh": 5661,
 "[eax+edx]": 5655,
 "ch": 5650,
 "$f14": 5634,
 "s7": 5599,
 "psubw": 5542,
 "[arm_r3,arm_r2]": 5517,
 "[x12,CONST]": 5506,
 "[reg_base_pointer+eax*4-CONST]": 5466,
 "wsbh": 5461,
 "comiss": 5428,
 "andpd": 5411,
 "[rcx+rax*8]": 5406,
 "mthc1": 5357,
 "s10": 5357,
 "dmfc1": 5350,
 "v17.16b": 5346,
 "[rdx+rdx]": 5314,
 "cvt.d.s": 5311,
 "[edx+edx]": 5302,
 "rorx": 5280,
 "mult": 5279,
 "[eax+eax*4]": 5275,
 "pslld": 5242,
 "[edx+edx*2]": 5237,
 "mtlo": 5212,
 "[reg_pc,arm_r0]": 5211,
 "[esi+eax*4]": 5197,
 "[edi-1]": 5187,
 "d15": 5151,
 "[x2,-CONST]": 5141,
 "[edi+eax*4]": 5128,
 "[esi+eax+CONST]": 5119,
 "v16.16b": 5116,
 "[rax+rcx*4]": 5087,
 "[ebx+eax]": 5054,
 "swc1": 5047,
 "ymm0": 5014,
 "sxtb": 5008,
 "$f6": 4994,
 "[eax+esi]": 4985,
 "[rax-8]": 4964,
 "bc1f": 4924,
 "[rcx+rdx]": 4921,
 "rep movsb": 4887,
 "$f3": 4887,
 "v9.16b": 4866,
 "divss": 4852,
 "[eax+ebx*4]": 4847,
 "[eax*4+CONST]": 4838,
 "ldursw": 4828,
 "[rsi+rax]": 4824,
 "repne scasb": 4824,
 "[arm_r0,arm_r1]": 4818,
 "bh": 4817,
 "[arm_r7,arm_r3]": 4807,
 "-CONST($a2)": 4800,
 "d16": 4695,
 "punpcklbw": 4678,
 "[rdx+rdx*2]": 4677,
 "mvneq": 4665,
 "[arm_r1,arm_r0,lsl CONST]": 4631,
 "bc1t": 4627,
 "[r11]": 4583,
 "[x9,x8]": 4573,
 "[rbx+rax+CONST]": 4560,
 "[arm_r3,arm_r4,lsl CONST]": 4547,
 "fsubr": 4542,
 "strbeq": 4525,
 "r9w": 4492,
 "st(5)": 4477,
 "st1": 4472,
 "bicne": 4444,
 "mfhc1": 4441,
 "[x13,CONST]": 4423,
 "psraw": 4408,
 "fsubrp": 4405,
 "[x19,-CONST]": 4378,
 "[x11]": 4340,
 "umlal": 4332,
 "v10.16b": 4316,
 "[edi+eax+CONST]": 4308,
 "vmovdqa": 4299,
 "ldrbne": 4294,
 "[eax+edi]": 4294,
 "s16": 4289,
 "[edx+eax+CONST]": 4286,
 "[arm_r5,arm_r3]": 4277,
 "[rax+rbx*8]": 4271,
 "fucomi": 4259,
 "CONST.50000000": 4259,
 "v7.16b": 4259,
 "[rax+rdx*4+CONST]": 4243,
 "fchs": 4228,
 "[rcx-CONST]": 4224,
 "s11": 4220,
 "ymm6": 4217,
 "[ebx+eax*4]": 4206,
 "v18.16b": 4185,
 "[ecx+edx*4]": 4155,
 "andeq": 4132,
 "setae": 4120,
 "v26.16b": 4111,
 "ymm11": 4110,
 "cmovae": 4084,
 "cvt.d.l": 4079,
 "[rdi+rax]": 4059,
 "uxtb": 4059,
 "hs": 4048,
 "[rsi-CONST]": 4043,
 "r15w": 4041,
 "[x14,CONST]": 4037,
 "pshufd": 4005,
 "[eax+edx+CONST]": 4003,
 "ldrd": 4000,
 "[rdx-CONST]": 3985,
 "[rdi-CONST]": 3968,
 "bfxil": 3960,
 "v25.16b": 3937,
 "v0.2d": 3936,
 "ymm10": 3930,
 "r14w": 3924,
 "[reg_base_pointer+rax*4-CONST]": 3922,
 "[esi+edx]": 3916,
 "CONST($t2)": 3893,
 "strgt": 3886,
 "[rax+rcx+CONST]": 3874,
 "[eax+reg_base_pointer*4]": 3864,
 "r13w": 3840,
 "$f28": 3816,
 "r12w": 3815,
 "packuswb": 3809,
 "[arm_r7,-CONST]": 3808,
 "[eax+ebx]": 3804,
 "[rcx+rdx*8]": 3788,
 "[r13-CONST]": 3787,
 "q2": 3776,
 "[rax-2]": 3771,
 "[arm_r0,arm_r1,lsl CONST]": 3771,
 "fcsel": 3769,
 "setbe": 3765,
 "pmulhw": 3765,
 "[rax-4]": 3756,
 "[x0,x2,lsl CONST]": 3748,
 "[ecx+ecx*2]": 3741,
 "[reg_stack_pointer-4]": 3731,
 "s12": 3731,
 "fmadd": 3731,
 "xchg": 3725,
 "r10w": 3709,
 "setle": 3705,
 "[reg_stack_pointer+rax+CONST]": 3652,
 "[ecx-4]": 3650,
 "[arm_r2,arm_r1,lsl CONST]": 3645,
 "($t2)": 3642,
 "aesenc": 3630,
 "andps": 3626,
 "[r12-1]": 3624,
 "[eax+ecx+CONST]": 3614,
 "[rdi-8]": 3598,
 "v11.16b": 3586,
 "[ebx+eax+CONST]": 3576,
 "subeq": 3551,
 "[ecx+eax+CONST]": 3524,
 "tbl": 3495,
 "[rax+rbx]": 3487,
 "[x20,-CONST]": 3479,
 "ldrge": 3475,
 "[reg_pc,arm_r3,lsl CONST]": 3455,
 "[r12+rax]": 3446,
 "s17": 3441,
 "vaesenc": 3440,
 "[x15,CONST]": 3414,
 "ldrlt": 3411,
 "[r14-1]": 3383,
 "ldrbeq": 3383,
 "rep stosq": 3378,
 "vpaddq": 3375,
 "lsrne": 3352,
 "[rdx+rcx]": 3339,
 "[lr,-CONST]": 3339,
 "bsr": 3314,
 "[x2,x0]": 3302,
 "mthi": 3281,
 "[reg_base_pointer+rax]": 3278,
 "pople": 3276,
 "psllq": 3270,
 "madd.d": 3244,
 "[eax-2]": 3233,
 "strle": 3229,
 "punpckldq": 3227,
 "[rax+reg_base_pointer*8]": 3217,
 "dinsu": 3212,
 "v21.16b": 3212,
 "v20.16b": 3210,
 "[rax+rdx*8+CONST]": 3205,
 "lslne": 3198,
 "$f27": 3180,
 "[x3,-CONST]": 3174,
 "v19.16b": 3157,
 "ymm12": 3150,
 "srav": 3130,
 "[rbx+rax*8]": 3126,
 "[r13-1]": 3125,
 "punpcklwd": 3120,
 "v23.16b": 3115,
 "setl": 3113,
 "ddivu": 3100,
 "ymm8": 3096,
 "[rax+r13]": 3079,
 "[edx+ecx]": 3076,
 "c.olt.d": 3073,
 "fcvtzu": 3066,
 "[arm_r8,arm_r3]": 3062,
 "[arm_r0,arm_r3]": 3038,
 "[ebx-1]": 3033,
 "($t3)": 3021,
 "[eax+esi+CONST]": 3021,
 "aesd": 3020,
 "[edx*4+CONST]": 3018,
 "dsllv": 3017,
 "[arm_r3,arm_r5,lsl CONST]": 3012,
 "[reg_base_pointer+eax]": 3005,
 "CONST($t3)": 2998,
 "uxth": 2992,
 "ymm13": 2990,
 "dsra32": 2986,
 "ucomiss": 2984,
 "[arm_r3,arm_r1,lsl CONST]": 2978,
 "poplt": 2976,
 "[esi+eax*4+CONST]": 2948,
 "[edx+ecx*4]": 2938,
 "addge": 2935,
 "ymm4": 2931,
 "[ebx+eax*4+CONST]": 2930,
 "strlt": 2921,
 "subgt": 2917,
 "[ecx+edx+CONST]": 2912,
 "-CONST($a3)": 2906,
 "[arm_r8,-CONST]": 2905,
 "[edx-4]": 2904,
 "[rdx*8]": 2900,
 "[sb,-CONST]": 2900,
 "v22.16b": 2887,
 "ldrgt": 2861,
 "[reg_base_pointer-2]": 2822,
 "[rax+rdx+CONST]": 2811,
 "[rax*4+CONST]": 2810,
 "ymm9": 2810,
 "[rdi+rax*8]": 2802,
 "rep stosb": 2790,
 "[edi+edx]": 2788,
 "d17": 2773,
 "fdivrp": 2764,
 "[rcx+rdx+CONST]": 2763,
 "s18": 2756,
 "[x0,x1]": 2751,
 "[x4,-CONST]": 2748,
 "[x1,x0,lsl CONST]": 2747,
 "[eax+edx*2]": 2747,
 "s13": 2743,
 "[r14+rax]": 2742,
 "aesimc": 2740,
 "v0.2s": 2736,
 "[rax+reg_base_pointer]": 2733,
 "[arm_r3,arm_r1]": 2707,
 "vpand": 2705,
 "[reg_stack_pointer+eax+CONST]": 2703,
 "r11w": 2691,
 "[reg_base_pointer+eax-CONST]": 2689,
 "[edx+edx*4]": 2688,
 "adcs": 2672,
 "pmullw": 2650,
 "[edi+eax*4+CONST]": 2633,
 "[edx+edx*2+CONST]": 2633,
 "[r15-1]": 2632,
 "[rdi+rax+CONST]": 2632,
 "[rcx+rcx]": 2627,
 "eorne": 2620,
 "[ebx+ecx]": 2616,
 "mov.s": 2616,
 "[reg_base_pointer+eax+CONST]": 2609,
 "[rdi+rcx]": 2608,
 "[reg_base_pointer+eax*4]": 2606,
 "s20": 2604,
 "fneg": 2602,
 "[rdi-1]": 2595,
 "fdivr": 2595,
 "[arm_r4,arm_r2]": 2593,
 "s19": 2589,
 "psrlq": 2571,
 "q3": 2566,
 "[x9,-CONST]": 2564,
 "[rax+rdx*2]": 2547,
 "[rdi+rax*4]": 2545,
 "vpor": 2540,
 "ymm3": 2539,
 "umulh": 2534,
 "[r15+rax]": 2529,
 "[rsi+rdx]": 2522,
 "s14": 2522,
 "[edx+esi]": 2510,
 "[ecx+eax*8]": 2510,
 "strge": 2501,
 "[ebx+edx]": 2500,
 "[eax+ecx*4+CONST]": 2500,
 "d19": 2494,
 "bxne": 2487,
 "v29.16b": 2480,
 "[x8,x9]": 2479,
 "ushr": 2478,
 "[sl,-CONST]": 2472,
 "ldmdb": 2471,
 "[x25,-CONST]": 2464,
 "[edi+esi]": 2464,
 "[esi+edi]": 2464,
 "[rdi+rcx*4]": 2462,
 "[edi+esi*4]": 2449,
 "lsleq": 2444,
 "punpckhwd": 2441,
 "[arm_r2,arm_r1]": 2436,
 "[ecx+ecx*4]": 2433,
 "[reg_base_pointer-5]": 2422,
 "[eax+edi+CONST]": 2422,
 "v0.4s": 2416,
 "[ip,arm_r0]": 2415,
 "[rsi+rcx]": 2406,
 "[rdx*4]": 2405,
 "[esi-4]": 2403,
 "[reg_base_pointer+rax+CONST]": 2391,
 "[rcx+rdx*4]": 2384,
 "[edx+esi*4]": 2384,
 "CONST($t4)": 2381,
 "[ecx+esi]": 2372,
 "sbfx": 2370,
 "[esi+ebx]": 2356,
 "dsrlv": 2349,
 "[rcx*8]": 2347,
 "[esi+eax*8]": 2343,
 "[r13+rax]": 2337,
 "[edx+eax*8]": 2326,
 "[x2,x1]": 2324,
 "[x2,x0,lsl CONST]": 2314,
 "[edi*4]": 2313,
 "[rdi+rsi]": 2309,
 "[rsi+rax*4]": 2298,
 "$f8": 2287,
 "[x12]": 2287,
 "[rcx+rax+CONST]": 2286,
 "psubd": 2278,
 "[arm_r1,arm_r0]": 2277,
 "ymm14": 2270,
 "d18": 2269,
 "[ecx+ebx]": 2264,
 "sxtb CONST": 2261,
 "[rcx*8+CONST]": 2252,
 "[arm_r3,arm_r6,lsl CONST]": 2237,
 "[edi+ebx]": 2236,
 "[rax+rax*2+CONST]": 2232,
 "-CONST.00000000": 2231,
 "v27.16b": 2221,
 "[x5,-CONST]": 2220,
 "[eax+ebx+CONST]": 2215,
 "[esi+ecx]": 2212,
 "[rdi+rdx]": 2209,
 "[edi-4]": 2204,
 "addle": 2203,
 "lsl arm_r2": 2199,
 "[edi+edi*2]": 2199,
 "[sb,arm_r3]": 2188,
 "[edi+ecx]": 2185,
 "[rbx+rbx]": 2176,
 "[ecx+eax*4+CONST]": 2173,
 "($t4)": 2172,
 "aesdec": 2170,
 "v30.16b": 2169,
 "[rbx+rax*4]": 2166,
 "lsl arm_r3": 2163,
 "[rax+rsi]": 2160,
 "trunc.w.d": 2154,
 "[arm_r1,arm_r3,lsl CONST]": 2152,
 "[rbx-8]": 2151,
 "v31.16b": 2151,
 "s21": 2147,
 "st(6)": 2147,
 "[eax+ecx*2]": 2142,
 "[edx+ebx]": 2137,
 "[edi+edx*4]": 2127,
 "[ecx*4]": 2113,
 "ldrbgt": 2109,
 "[x1,w0,sxtw CONST]": 2108,
 "[arm_r0,arm_r2]": 2105,
 "d20": 2098,
 "dup": 2093,
 "[edi+esi+CONST]": 2083,
 "[esi+ebx+CONST]": 2083,
 "[rax+r12]": 2081,
 "[r15-CONST]": 2079,
 "[r12-CONST]": 2076,
 "v4.8b": 2072,
 "[esi*4]": 2068,
 "[arm_r1,arm_r2,lsl CONST]": 2066,
 "[eax+reg_base_pointer]": 2064,
 "addlt": 2061,
 "[ecx*4+CONST]": 2058,
 "c.ule.d": 2054,
 "extr": 2043,
 "$f15": 2035,
 "[esi+esi*2]": 2032,
 "[rbx+rax*8+CONST]": 2018,
 "[reg_base_pointer+reg_base_pointer*2]": 2016,
 "[ebx-4]": 2016,
 "[esi+edi*4]": 2009,
 "[ecx+edi]": 2008,
 "orrhs": 2008,
 "[reg_base_pointer+edi*4]": 2005,
 "v28.16b": 2005,
 "[r12+rax*8]": 2002,
 "vpsrlq": 1990,
 "ddiv": 1982,
 "[r8-1]": 1972,
 "v1.4s": 1972,
 "[edx+edi]": 1968,
 "lsl arm_r1": 1962,
 "jnp": 1957,
 "[reg_base_pointer+rax-CONST]": 1955,
 "v4.4s": 1946,
 "v22.8h": 1945,
 "[eax+esi*4+CONST]": 1944,
 "[x13]": 1941,
 "[esi+edx+CONST]": 1941,
 "[reg_base_pointer+rax*4]": 1939,
 "[esi+edx*4]": 1936,
 "$f30": 1930,
 "[esi+edi+CONST]": 1927,
 "[eax+edx*8+CONST]": 1926,
 "frintx": 1926,
 "$fcc0": 1918,
 "v18.8h": 1918,
 "[x16,CONST]": 1916,
 "[arm_r7,arm_r2]": 1916,
 "[reg_base_pointer*4]": 1910,
 "[edi+eax*2]": 1910,
 "[esi+eax*2]": 1907,
 "-CONST($t0)": 1899,
 "[arm_r3,arm_r4]": 1896,
 "[rdx+rcx*4]": 1893,
 "[x21,-CONST]": 1893,
 "[edi*4+CONST]": 1887,
 "[reg_base_pointer+rax*8]": 1876,
 "[rax+r14*8]": 1875,
 "[eax+ebx-CONST]": 1873,
 "[ebx+eax*8]": 1867,
 "[esi+ecx+CONST]": 1867,
 "[ebx+edi]": 1854,
 "[edi+ecx*4]": 1852,
 "[ecx+esi*4]": 1852,
 "[reg_stack_pointer+eax*4+CONST]": 1850,
 "orps": 1847,
 "subge": 1845,
 "[edx+eax*2]": 1842,
 "[rax+r15]": 1840,
 "[edx+ecx+CONST]": 1840,
 "[rbx+rax*4+CONST]": 1839,
 "[rdx+rcx*8]": 1837,
 "v20.8h": 1836,
 "[x18,CONST]": 1835,
 "x[reg_stack_pointer]": 1833,
 "dextu": 1832,
 "[x8,x9,lsl CONST]": 1825,
 "[esi+esi]": 1824,
 "[reg_base_pointer+rax*8-CONST]": 1821,
 "[ip,arm_r2]": 1814,
 "vpshufb": 1814,
 "[r15+rax*8]": 1813,
 "[r8+rax]": 1812,
 "[eax+edx*8]": 1808,
 "[r12+rax*4]": 1805,
 "[ecx+eax*2]": 1802,
 "[rax+r14]": 1800,
 "drotr": 1797,
 "[ebx+edx+CONST]": 1794,
 "b.pl": 1789,
 "v2.4s": 1775,
 "[rsi+rax+CONST]": 1774,
 "v0.8h": 1774,
 "subls": 1769,
 "setge": 1763,
 "[r15+rax+CONST]": 1755,
 "[eax+eax*8]": 1754,
 "[r14+rax*8]": 1748,
 "v3.4s": 1748,
 "[r12+rax+CONST]": 1745,
 "[eax+ebx*2]": 1745,
 "addhi": 1737,
 "maxss": 1730,
 "[sl,arm_r3]": 1729,
 "v2.8h": 1728,
 "c.eq.d": 1727,
 "[rax+r12*8]": 1715,
 "[edx-8]": 1714,
 "v0.8b": 1714,
 "[edi+ecx+CONST]": 1713,
 "ushll": 1710,
 "ymm15": 1710,
 "[ebx+eax-CONST]": 1707,
 "[ebx+esi]": 1706,
 "drotr32": 1702,
 "[reg_base_pointer+rbx+CONST]": 1702,
 "ldursh": 1701,
 "[rax+r13*8]": 1699,
 "minss": 1695,
 "[ecx*8]": 1691,
 "[rsi+rax*8]": 1686,
 "[edi+edi]": 1683,
 "[rax+rax+CONST]": 1682,
 "[rbx*8+CONST]": 1682,
 "h0": 1671,
 "[rax+rcx*8+CONST]": 1665,
 "rep movsq": 1661,
 "[ecx+ecx]": 1660,
 "dins": 1656,
 "v29.2s": 1651,
 "[r13+rax*4]": 1649,
 "[reg_base_pointer+rdx]": 1648,
 "sxth CONST": 1646,
 "paddq": 1643,
 "[rdx+rdx*4]": 1639,
 "[rbx+reg_base_pointer]": 1634,
 "[arm_r0,arm_r3,lsl CONST]": 1624,
 "[rbx+reg_base_pointer+CONST]": 1624,
 "[x10,-CONST]": 1620,
 "s22": 1616,
 "[eax+esi*2]": 1614,
 "[edx+eax*4+CONST]": 1612,
 "s24": 1612,
 "[ecx-2]": 1611,
 "stlr": 1606,
 "[ecx+edi*4]": 1600,
 "$f10": 1599,
 "s15": 1599,
 "[reg_base_pointer+reg_base_pointer]": 1598,
 "[esi+ebx*4]": 1598,
 "[rdx-4]": 1595,
 "[rcx+rcx*4]": 1594,
 "[r9-1]": 1592,
 "[ebx+eax*2]": 1592,
 "vpmuludq": 1590,
 "punpckhbw": 1586,
 "v7.4s": 1580,
 "v17.4s": 1579,
 "v16.4s": 1578,
 "vmovd": 1577,
 "[r14+rax+CONST]": 1576,
 "[rbx+rcx]": 1573,
 "($t5)": 1569,
 "[edi+ebx*4]": 1568,
 "[x1,x2]": 1568,
 "[rbx*8]": 1565,
 "ldrle": 1565,
 "[esi+edi*4+CONST]": 1564,
 "[reg_base_pointer+edi]": 1563,
 "[rax+rcx*2]": 1562,
 "[reg_stack_pointer+rax*4+CONST]": 1560,
 "[esi+reg_base_pointer]": 1558,
 "[r14-CONST]": 1556,
 "[ebx+ebx*2]": 1554,
 "lsl arm_r0": 1554,
 "[ebx+edx*4]": 1552,
 "[ebx+ebx]": 1543,
 "[eax+eax*2+CONST]": 1541,
 "[x22,-CONST]": 1537,
 "v28.2s": 1537,
 "s25": 1534,
 "[r13*8]": 1533,
 "[arm_r3,arm_r7,lsl CONST]": 1532,
 "fimul": 1531,
 "asreq": 1525,
 "s23": 1524,
 "q4": 1522,
 "[eax*8+CONST]": 1520,
 "[edi+ebx+CONST]": 1520,
 "[rbx+rdx]": 1519,
 "[rdi+rax*2]": 1519,
 "[edx*8]": 1519,
 "[r12+rbx]": 1518,
 "[eax+ecx*8]": 1516,
 "[reg_base_pointer+esi]": 1511,
 "[r9+rax]": 1510,
 "[edx+edi*4]": 1510,
 "s26": 1509,
 "strhi": 1503,
 "[ip,arm_r1]": 1502,
 "csinv": 1494,
 "[eax+esi*8]": 1486,
 "[ebx+esi+CONST]": 1483,
 "[ebx+ecx+CONST]": 1479,
 "[reg_base_pointer+esi*4]": 1477,
 "[ebx-8]": 1475,
 "[x7,-CONST]": 1475,
 "[reg_base_pointer+eax*4+CONST]": 1473,
 "[rsi+rsi*2]": 1471,
 "lsl ip": 1471,
 "adcx": 1470,
 "[arm_r3,arm_r6]": 1469,
 "[r14+rax*4]": 1464,
 "[eax+edi*2]": 1462,
 "[arm_r4,arm_r0]": 1462,
 "[rbx+rdx+CONST]": 1458,
 "[edx-2]": 1455,
 "[rsi+rax*2]": 1454,
 "[arm_r3,arm_r8,lsl CONST]": 1454,
 "v1.8h": 1454,
 "[ecx+ebx+CONST]": 1452,
 "[rcx+rax*2]": 1451,
 "dmultu": 1449,
 "[x6,-CONST]": 1449,
 "[reg_base_pointer+edx*4-CONST]": 1448,
 "[rdx+rsi]": 1444,
 "fsqrt": 1444,
 "[rbx+rdx*8]": 1441,
 "movntq": 1440,
 "psrad": 1434,
 "[edi+edx+CONST]": 1434,
 "[eax+edi*4+CONST]": 1433,
 "[r15+rax*4]": 1429,
 "rsc": 1425,
 "[arm_r6,arm_r2]": 1424,
 "[eax+eax+CONST]": 1421,
 "[x1,x2,lsl CONST]": 1420,
 "[esi-8]": 1419,
 "[esi+ecx*4]": 1417,
 "[reg_base_pointer+ecx]": 1417,
 "[arm_r2,arm_r0]": 1416,
 "[x0,x2]": 1416,
 "v5.4s": 1416,
 "[rdx+rax*2]": 1415,
 "[edi-2]": 1414,
 "punpcklqdq": 1414,
 "[x8,x11,lsl CONST]": 1410,
 "[rax+r15*8]": 1407,
 "[rax+rbx*4]": 1406,
 "[x3,x0]": 1406,
 "[rcx+rsi]": 1402,
 "pmull": 1400,
 "-CONST($t1)": 1394,
 "[reg_base_pointer,arm_r3]": 1393,
 "[r14+rbx]": 1392,
 "[rax+rbx+CONST]": 1391,
 "[edi+eax*8]": 1389,
 "addmi": 1384,
 "[reg_base_pointer*8]": 1382,
 "[r10+rax]": 1382,
 "orpd": 1379,
 "[r13+rax+CONST]": 1377,
 "v1.8b": 1373,
 "[r8+rcx]": 1371,
 "[x1,w0,sxtw]": 1370,
 "[arm_r3,arm_r0]": 1369,
 "vmovups": 1367,
 "fcmovnbe": 1366,
 "movupd": 1366,
 "[rcx-8]": 1360,
 "[arm_r3,arm_r5]": 1358,
 "[rdi-4]": 1356,
 "[rbx-4]": 1356,
 "[r11+rax]": 1353,
 "stmdb": 1351,
 "[edi+reg_base_pointer]": 1350,
 "v1.2s": 1346,
 "[edi+reg_base_pointer*4]": 1345,
 "[r8-CONST]": 1343,
 "[arm_r5,arm_r4,lsl CONST]": 1339,
 "[rax+rsi*8]": 1338,
 "c.lt.d": 1338,
 "[ebx+ebx*4]": 1337,
 "[reg_base_pointer+reg_base_pointer*4]": 1336,
 "[x9,x8,lsl CONST]": 1332,
 "[x19,x0]": 1331,
 "vpinsrd": 1331,
 "strlo": 1329,
 "[r8+rax*4]": 1328,
 "q6": 1324,
 "[eax+reg_base_pointer+CONST]": 1324,
 "d21": 1322,
 "$f29": 1315,
 "pmaddwd": 1312,
 "q5": 1306,
 "[r12+rbx*8]": 1305,
 "pcmpeqd": 1300,
 "v24.8h": 1300,
 "[rax+rax*8]": 1298,
 "s28": 1297,
 "b.vs": 1292,
 "($t6)": 1290,
 "[ecx+edx*2]": 1285,
 "[x3,x0,lsl CONST]": 1284,
 "biceq": 1282,
 "lsreq": 1280,
 "[x14]": 1278,
 "s27": 1278,
 "v16.8h": 1277,
 "[r15+rbx]": 1276,
 "[x0,w19,sxtw CONST]": 1275,
 "[x17,CONST]": 1275,
 "[rsi+rsi]": 1274,
 "[esi-2]": 1274,
 "orrgt": 1274,
 "[x15]": 1272,
 "[x1,w0,uxtw CONST]": 1271,
 "[arm_r4,arm_r3,lsl CONST]": 1270,
 "[rbx+rbx*2]": 1266,
 "[rax+rdx*2+CONST]": 1264,
 "[reg_stack_pointer+rax*8+CONST]": 1264,
 "[eax+edx*2+CONST]": 1259,
 "v6.8b": 1250,
 "strls": 1249,
 "[x2,x1,lsl CONST]": 1245,
 "psllw": 1242,
 "[x0,x3]": 1240,
 "CONST($t6)": 1238,
 "[r13+rax*8]": 1234,
 "pandn": 1234,
 "[arm_r3,arm_r7]": 1232,
 "v19.8h": 1232,
 "[x21,x0,lsl CONST]": 1231,
 "[rax+rdi]": 1229,
 "[esi+reg_base_pointer*4]": 1228,
 "[ecx-8]": 1226,
 "[edi*8]": 1225,
 "[arm_r0,sl,lsl CONST]": 1225,
 "[reg_base_pointer*8+CONST]": 1221,
 "mvnlt": 1220,
 "[reg_base_pointer+edx]": 1220,
 "[esi+reg_base_pointer+CONST]": 1215,
 "[ecx+esi+CONST]": 1215,
 "[rdx+rsi*8]": 1214,
 "[edi+esi*4+CONST]": 1214,
 "v6.4s": 1214,
 "[ebx*4]": 1213,
 "mulx": 1210,
 "x[eax-CONST]": 1208,
 "v2.8b": 1206,
 "d22": 1201,
 "[esi*8]": 1200,
 "[ebx+edx*4-CONST]": 1200,
 "[rdx+rcx+CONST]": 1196,
 "[eax+edx*4-CONST]": 1196,
 "[rsi+rcx+CONST]": 1194,
 "CONST($t5)": 1193,
 "[x0,x3,lsl CONST]": 1193,
 "[eax-3]": 1191,
 "v5.8b": 1188,
 "[rdi+rax*8+CONST]": 1187,
 "[r14+r14]": 1187,
 "[arm_r5,arm_r3,lsl CONST]": 1187,
 "popls": 1177,
 "[ebx+ecx*4-CONST]": 1174,
 "v16.8b": 1172,
 "[rax+rcx*4+CONST]": 1171,
 "[edx+esi+CONST]": 1170,
 "vpclmulqdq": 1168,
 "[arm_r0,arm_r2,lsl CONST]": 1166,
 "rscs": 1165,
 "[rcx+rax*8+CONST]": 1162,
 "[reg_base_pointer+rbx]": 1160,
 "pshufb": 1160,
 "adox": 1160,
 "[edx+ecx*8]": 1152,
 "[rdx+rax*4+CONST]": 1149,
 "[ecx+ebx*4]": 1148,
 "pl": 1144,
 "[x3,x1]": 1143,
 "[rdi+rax*4+CONST]": 1141,
 "[rbx-2]": 1141,
 "smulh": 1141,
 "[ecx+edx*4+CONST]": 1139,
 "bpl": 1137,
 "b0": 1137,
 "[x0,w1,sxtw]": 1136,
 "[edx+ebx*4]": 1132,
 "q7": 1130,
 "andnpd": 1130,
 "[arm_r4,arm_r1]": 1128,
 "[esi+esi*4]": 1127,
 "$f16": 1125,
 "v1.2d": 1125,
 "($t7)": 1121,
 "v6.2d": 1121,
 "psrlw": 1120,
 "[ebx+ecx*4]": 1119,
 "[arm_r5,arm_r2]": 1117,
 "v9.2d": 1117,
 "v8.2d": 1115,
 "$f5": 1114,
 "[reg_base_pointer+eax*8-CONST]": 1114,
 "cvt.s.d": 1112,
 "[edx+reg_base_pointer]": 1112,
 "[edx+ecx*2]": 1111,
 "[reg_base_pointer-6]": 1110,
 "s31": 1110,
 "[lr,arm_r3]": 1109,
 "[x20,x0,lsl CONST]": 1106,
 "cvtss2si": 1105,
 "[rdx-2]": 1102,
 "[edx+eax-1]": 1102,
 "[rbx+r12]": 1100,
 "[x11,-CONST]": 1099,
 "[edi+eax-CONST]": 1099,
 "[r12+rdx]": 1096,
 "[arm_r2,arm_r4]": 1094,
 "v21.8h": 1094,
 "v26.8h": 1094,
 "[x3,x2]": 1088,
 "[x20,x19,lsl CONST]": 1087,
 "[x0,x19,lsl CONST]": 1084,
 "[rbx+rcx+CONST]": 1082,
 "[eax+ecx*4-CONST]": 1080,
 "[rcx+rsi*8]": 1079,
 "orn": 1079,
 "rsbne": 1079,
 "fcmovbe": 1078,
 "s29": 1075,
 "[r15+reg_base_pointer]": 1074,
 "[rsi+rdi]": 1072,
 "[rdx+rax*8+CONST]": 1070,
 "[reg_base_pointer+esi*4+CONST]": 1069,
 "v15.16b": 1068,
 "strhne": 1066,
 "[rcx*4]": 1059,
 "[esi*4+CONST]": 1058,
 "v27.8h": 1058,
 "[rdi+rbx]": 1057,
 "[reg_stack_pointer+rdx+CONST]": 1054,
 "[x4,x0]": 1053,
 "[arm_r3,arm_r0,lsl CONST]": 1053,
 "[rdi-2]": 1051,
 "v0.s[0]": 1051,
 "[x23,-CONST]": 1050,
 "[arm_r3,sl,lsl CONST]": 1050,
 "dextm": 1050,
 "[r9+rax+CONST]": 1049,
 "[rbx+r13]": 1045,
 "[reg_base_pointer+ebx]": 1045,
 "[ebx+esi*4+CONST]": 1044,
 "[r14+rbx*8]": 1043,
 "[r9-CONST]": 1041,
 "[ebx+esi*4]": 1040,
 "trn1": 1040,
 "[x2,x3]": 1038,
 "[reg_base_pointer+ecx*4]": 1035,
 "[reg_base_pointer+rcx]": 1034,
 "csetm": 1033,
 "v19.4s": 1033,
 "[rcx-2]": 1032,
 "cmpls": 1029,
 "[x20,x0]": 1028,
 "v23.8h": 1027,
 "[rbx*4]": 1026,
 "emms": 1025,
 "[x21,x19,lsl CONST]": 1025,
 "rev32": 1024,
 "[x19,x0,lsl CONST]": 1023,
 "[rsi+rdx*8]": 1021,
 "[x5,x0]": 1020,
 "v4.8h": 1020,
 "vpalignr": 1020,
 "[ebx+reg_base_pointer]": 1017,
 "[x6,x0]": 1015,
 "v17.8h": 1015,
 "[edx+ebx+CONST]": 1014,
 "v12.16b": 1013,
 "ccmn": 1010,
 "[ecx+eax-1]": 1009,
 "[ebx+edi+CONST]": 1001,
 "[esi+edx*2]": 1000,
 "[ecx+reg_base_pointer*4]": 998,
 "[r12+reg_base_pointer]": 995,
 "[reg_pc]": 995,
 "[arm_r6,arm_r3,lsl CONST]": 994,
 "[r13+rbx]": 990,
 "[rdx+rdi*4]": 987,
 "[edx+edi+CONST]": 987,
 "[reg_base_pointer+ecx+CONST]": 986,
 "[reg_base_pointer+esi+CONST]": 985,
 "[r15+rbx*8]": 983,
 "[rax+reg_base_pointer*4]": 980,
 "[ecx+edi+CONST]": 980,
 "[reg_base_pointer+edi+CONST]": 980,
 "[arm_r3,arm_r8]": 980,
 "[arm_r3,ip]": 980,
 "[reg_base_pointer+edi*4+CONST]": 978,
 "v21.4s": 976,
 "[ebx+edx*8]": 976,
 "[arm_r3,sb,lsl CONST]": 975,
 "[reg_stack_pointer+reg_base_pointer+CONST]": 974,
 "[ebx+eax*8+CONST]": 973,
 "[r15+rcx]": 972,
 "[rax+r8]": 972,
 "[x4,x0,lsl CONST]": 971,
 "[edi+edi*4]": 971,
 "[r12+rcx]": 968,
 "[x0,x4]": 968,
 "[x0,x20,lsl CONST]": 968,
 "($t8)": 967,
 "v18.4s": 967,
 "[rcx+rax*4+CONST]": 966,
 "[arm_r2,arm_r0,lsl CONST]": 966,
 "[reg_base_pointer+edx+CONST]": 966,
 "[edx*8+CONST]": 964,
 "[edi+eax*8+CONST]": 964,
 "[esi+edx*4+CONST]": 963,
 "csneg": 963,
 "[rsi-2]": 961,
 "[x0,w1,sxtw CONST]": 960,
 "[eax+edi*8]": 958,
 "[ecx+ebx*2]": 957,
 "[x22,x19,lsl CONST]": 956,
 "[x20,x22,lsl CONST]": 953,
 "v3.8h": 953,
 "[reg_stack_pointer+ecx*4+CONST]": 952,
 "[ebx+edi*4]": 950,
 "v5.8h": 950,
 "[edx+ecx*4+CONST]": 949,
 "[r12+rbx+CONST]": 945,
 "[rax-3]": 945,
 "[r14+rcx]": 944,
 "[reg_base_pointer+rbx*8]": 942,
 "v7.2d": 942,
 "v7.8b": 942,
 "[r9+rax*4]": 941,
 "v4.2d": 940,
 "[arm_r7,arm_r4,lsl CONST]": 939,
 "cmple": 938,
 "[rsi+rdx*4]": 936,
 "[r12+r12*2]": 934,
 "[r12+r12]": 929,
 "[r8+rdx]": 929,
 "[arm_r2,arm_r4,lsl CONST]": 928,
 "[rsi+rax*4+CONST]": 927,
 "[arm_r5,arm_r0]": 927,
 "[edi+edx*2]": 927,
 "($t9)": 926,
 "[arm_r5,arm_r4]": 925,
 "[reg_base_pointer+rax*4+CONST]": 924,
 "[rcx+rdx*2]": 921,
 "[edi-8]": 921,
 "CONST($t7)": 919,
 "[rcx-4]": 918,
 "s30": 917,
 "[r14+reg_base_pointer]": 915,
 "sli": 915,
 "[x4,x1]": 914,
 "[eax+ecx*8+CONST]": 911,
 "smlal2": 910,
 "[reg_base_pointer+ebx+CONST]": 908,
 "suble": 907,
 "[esi+eax*8+CONST]": 906,
 "[rdi+r8]": 905,
 "[eax+ecx*4-4]": 905,
 "movpl": 905,
 "[x28,-CONST]": 902,
 "[ebx+edx*2]": 901,
 "ldrhne": 899,
 "[rax+rcx*2+CONST]": 898,
 "[ecx+reg_base_pointer]": 898,
 "[x4,x3]": 898,
 "[rdi+rdx+CONST]": 897,
 "[ebx+edx*4+CONST]": 897,
 "[esi+edx*8]": 896,
 "[edi+ecx*2]": 896,
 "[rax+r9]": 895,
 "[arm_r8,arm_r2]": 894,
 "[esi+eax*2+CONST]": 893,
 "minsd": 891,
 "[x0,x8]": 891,
 "[r10-1]": 888,
 "[x0,x20]": 886,
 "[x10,x9]": 886,
 "[rdi+rdi]": 885,
 "[x0,x9]": 885,
 "[arm_r6,arm_r4,lsl CONST]": 884,
 "[r10-CONST]": 883,
 "[rsi+rdx+CONST]": 880,
 "andn": 880,
 "rev64": 879,
 "smsubl": 879,
 "[rbx+reg_base_pointer*4+CONST]": 877,
 "[r12-2]": 877,
 "v16.2d": 876,
 "subpd": 874,
 "[x2,x3,lsl CONST]": 874,
 "[rdx-8]": 873,
 "[r12+r13]": 872,
 "[edi+ecx*8]": 871,
 "[reg_base_pointer+rdx+CONST]": 869,
 "v13.16b": 869,
 "[ecx+eax*4-CONST]": 867,
 "lsl arm_r6": 867,
 "[rcx*4+CONST]": 866,
 "[rdx*8+CONST]": 866,
 "[reg_stack_pointer+rcx+CONST]": 866,
 "cmpgt": 866,
 "[reg_stack_pointer+edx*4+CONST]": 866,
 "[esi+ebx*2]": 862,
 "ldrhi": 861,
 "[r14+rdx]": 859,
 "[rsi-8]": 859,
 "[esi+ebx*4+CONST]": 857,
 "[arm_r2,ip]": 856,
 "lsr arm_r0": 854,
 "[r13+rdx]": 853,
 "-CONST($t3)": 853,
 "[eax+edx-CONST]": 853,
 "[rax+r14*4]": 852,
 "movmi": 852,
 "[reg_stack_pointer+esi*4+CONST]": 852,
 "[rbx+r14]": 851,
 "[eax+ebx*4+CONST]": 851,
 "[x30]": 851,
 "-CONST($t2)": 850,
 "[rax+rsi+CONST]": 849,
 "v10.2d": 846,
 "[rdi+rsi+CONST]": 845,
 "[edx+eax-CONST]": 845,
 "v12.2d": 845,
 "v25.8h": 845,
 "v20.4s": 843,
 "v24.4s": 843,
 "[r8+rax+CONST]": 841,
 "[rbx+rax*2]": 841,
 "[edx+eax*8+CONST]": 841,
 "[reg_base_pointer+rdi*8+CONST]": 840,
 "vpandn": 840,
 "maxsd": 839,
 "[r9+rdx]": 836,
 "[arm_r0,ip]": 836,
 "[x1,w0,uxtw]": 835,
 "v17.8b": 835,
 "[x3,x1,lsl CONST]": 833,
 "[rax+reg_base_pointer+CONST]": 832,
 "[x16]": 830,
 "[reg_stack_pointer+reg_base_pointer*4+CONST]": 829,
 "[rdi+rcx+CONST]": 828,
 "[rdi+r10]": 828,
 "[x5,x1]": 827,
 "lsr arm_r2": 826,
 "neg.d": 826,
 "[arm_r6,arm_r0]": 825,
 "[ebx-2]": 824,
 "[reg_stack_pointer+edi+CONST]": 824,
 "[reg_base_pointer+edx*4]": 822,
 "[arm_r0,arm_r6,lsl CONST]": 821,
 "[edi+reg_base_pointer+CONST]": 819,
 "[x0,x19]": 818,
 "[edx+edx*8]": 818,
 "[arm_r3,sb]": 818,
 "v11.2d": 818,
 "[r14+reg_base_pointer*8]": 816,
 "lsrs": 816,
 "[rsi*4]": 815,
 "sqrtsd": 812,
 "[rdi+rdx*4]": 811,
 "[rbx+rbx*4]": 811,
 "v13.2d": 811,
 "[x0,x5]": 811,
 "[reg_base_pointer+ebx*4]": 808,
 "subhs": 808,
 "[edi+ebx*4+CONST]": 808,
 "[r10+rax*4]": 807,
 "[x1,x3,lsl CONST]": 804,
 "[rcx+reg_base_pointer]": 803,
 "[x19,x1]": 802,
 "lsl arm_r5": 802,
 "[rax+rsi*4]": 801,
 "pmull2": 800,
 "unpckhpd": 799,
 "lsl arm_r4": 799,
 "[sb,arm_r2]": 798,
 "[rdx+rdi]": 797,
 "[r15+rdx]": 796,
 "[rax+r15*4]": 796,
 "[rcx+rdi]": 796,
 "[rsi+rcx*4]": 794,
 "[arm_r5,arm_r7,lsl CONST]": 794,
 "[reg_stack_pointer+ebx*4+CONST]": 794,
 "[x1,x3]": 794,
 "[r9+rcx]": 793,
 "subhi": 793,
 "[x1,x4]": 793,
 "[r13+rbx*8]": 792,
 "[reg_base_pointer+eax*2]": 792,
 "v22.4s": 790,
 "[rdx+rsi*4]": 788,
 "[arm_r5,arm_r6,lsl CONST]": 787,
 "[edi+edx*4+CONST]": 786,
 "lwxc1": 785,
 "lslgt": 784,
 "[x24,-CONST]": 784,
 "[ecx+eax*2+CONST]": 784,
 "[reg_base_pointer+eax*8]": 783,
 "[rbx+rsi]": 779,
 "[rsi-4]": 778,
 "[arm_r0,arm_r4,lsl CONST]": 778,
 "[rdx+rbx]": 777,
 "[x22,x0]": 777,
 "[edx+ebx*2]": 777,
 "[x0,w20,sxtw CONST]": 775,
 "c.ult.d": 773,
 "[arm_r6,arm_r0,lsl CONST]": 771,
 "[x26,-CONST]": 770,
 "[reg_base_pointer*4+CONST]": 767,
 "[edx+eax*2+CONST]": 767,
 "[x2,x5]": 767,
 "[x2,w1,sxtw]": 767,
 "[rcx+r8]": 766,
 "[x12,-CONST]": 766,
 "[edx+esi*2]": 765,
 "[arm_r4,arm_r5,lsl CONST]": 764,
 "c.le.d": 764,
 "pinsrw": 764,
 "ldxc1": 762,
 "[x27,-CONST]": 762,
 "v25.4s": 762,
 "[arm_r7,arm_r3,lsl CONST]": 761,
 "v15.2d": 761,
 "[rsi*8]": 759,
 "[reg_stack_pointer+rcx*4+CONST]": 758,
 "[rdi*4]": 756,
 "[r12+rbx*4]": 755,
 "[r11+rax*4]": 755,
 "trn2": 755,
 "[x9,x10,lsl CONST]": 753,
 "[rdi+rdi*2]": 752,
 "[ecx+ecx*8]": 752,
 "v0.h[0]": 752,
 "[reg_base_pointer+rsi*8+CONST]": 751,
 "zip1": 751,
 "[x21,x0]": 750,
 "[x0,x21]": 750,
 "[reg_base_pointer+reg_base_pointer+CONST]": 749,
 "cmphs": 748,
 "[rsi+reg_base_pointer]": 747,
 "[arm_r8,arm_r4,lsl CONST]": 747,
 "ldpsw": 746,
 "fmsub": 743,
 "[reg_base_pointer+eax*2-CONST]": 740,
 "[esi+ecx*4+CONST]": 739,
 "[r12+rdx*4]": 738,
 "lsllt": 738,
 "[edx+ecx*8+CONST]": 738,
 "[x0,x21,lsl CONST]": 737,
 "[r12*8]": 735,
 "[r13+rcx]": 734,
 "pcmpgtd": 734,
 "[rax+r12*4]": 731,
 "[rsi+r8]": 731,
 "-2": 731,
 "[arm_r4,lr]": 731,
 "[x8,x10,lsl CONST]": 730,
 "popge": 729,
 "v2.2d": 729,
 "[ebx*4+CONST]": 728,
 "[rbx+r15]": 727,
 "[rbx+rdx*4+CONST]": 727,
 "packssdw": 726,
 "[reg_base_pointer+reg_base_pointer*8]": 725,
 "[rax+rbx*2]": 723,
 "fldpi": 723,
 "[eax+esi-CONST]": 722,
 "[rcx+rbx]": 721,
 "v2.2s": 720,
 "sublt": 719,
 "[x22,x0,lsl CONST]": 719,
 "andgt": 718,
 "[reg_stack_pointer+esi+CONST]": 718,
 "[x0,x22]": 717,
 "[arm_r0,arm_r4]": 715,
 "addlo": 715,
 "[rdx+rcx*2]": 713,
 "[r8+r8]": 712,
 "[reg_base_pointer+rax*8+CONST]": 712,
 "[rbx+r13+CONST]": 712,
 "[ip,arm_r3,lsl CONST]": 711,
 "[edi+ecx*4+CONST]": 711,
 "[reg_base_pointer+r12+CONST]": 707,
 "[reg_stack_pointer+edx+CONST]": 707,
 "[edx+eax*4-CONST]": 706,
 "cmplo": 706,
 "[rbx+r14+CONST]": 705,
 "[arm_r4,arm_r5]": 705,
 "[ecx+eax*8+CONST]": 704,
 "[x3,x2,lsl CONST]": 704,
 "cmneq": 703,
 "c.ole.d": 703,
 "[ecx+edx*8]": 703,
 "[eax+ebx*8]": 701,
 "tstne": 701,
 "movt": 700,
 "[rdx+r12]": 699,
 "ll": 699,
 "sc": 699,
 "v14.16b": 699,
 "v6.8h": 699,
 "[rcx+r12]": 696,
 "lsl lr": 696,
 "ldrbhs": 694,
 "[x20,x21,lsl CONST]": 694,
 "v19.2d": 694,
 "[r10+rcx]": 692,
 "[arm_r0,arm_r5,lsl CONST]": 691,
 "[x4,x2]": 690,
 "v8.8b": 690,
 "strheq": 690,
 "[rdi+rdx*2]": 688,
 "[x4,x1,lsl CONST]": 688,
 "[ecx+edi*2]": 688,
 "[lr,arm_r2]": 687,
 "($gp)": 685,
 "[r14+r13]": 685,
 "[rsi+rsi*4]": 685,
 "[arm_r7,arm_r1]": 685,
 "[reg_stack_pointer+rdx*4+CONST]": 684,
 "[r15+rbx+CONST]": 684,
 "[x0,x6]": 682,
 "[r14+rbx+CONST]": 679,
 "lsr arm_r3": 679,
 "[arm_r6,arm_r1]": 679,
 "[r11-1]": 678,
 "st(7)": 678,
 "[r10+rdx]": 677,
 "[rcx+r9]": 677,
 "[arm_r6,arm_r4]": 677,
 "[r14+r15]": 675,
 "[r11+rcx]": 675,
 "[arm_r1,ip]": 675,
 "[x21,x22,lsl CONST]": 675,
 "[reg_stack_pointer+rbx+CONST]": 673,
 "[reg_base_pointer+ecx*4-CONST]": 673,
 "[edx+reg_base_pointer*4]": 672,
 "[ebx+edi*4+CONST]": 672,
 "pcmpeqb": 672,
 "[reg_stack_pointer+edi*4+CONST]": 671,
 "[rdi+reg_base_pointer]": 670,
 "CONST($t8)": 670,
 "[ebx+esi*4-CONST]": 670,
 "[arm_r5,arm_r1]": 669,
 "[x23,x19,lsl CONST]": 669,
 "[edi+ebx*2]": 667,
 "[rbx+rcx*8]": 666,
 "[lr,arm_r0]": 666,
 "[arm_r7,arm_r0]": 665,
 "[r13+r13]": 662,
 "[ebx*8]": 661,
 "[eax+eax-1]": 660,
 "[ebx+ecx*4+CONST]": 659,
 "[x19,x20,lsl CONST]": 659,
 "v29.4s": 658,
 "[rcx+rsi*4]": 657,
 "[r12*8+CONST]": 657,
 "blne": 656,
 "[rbx+reg_base_pointer*8+CONST]": 655,
 "[esi+ecx*2]": 654,
 "[rdi+r9]": 652,
 "[rdx+r8]": 652,
 "vpunpckldq": 652,
 "pavgusb": 650,
 "sqrshrun": 650,
 "[r12+rdx+CONST]": 649,
 "[rax+r10]": 649,
 "[r12+r15]": 649,
 "[r15+rax*8+CONST]": 649,
 "[ecx+esi*2]": 649,
 "[arm_r6,arm_r5,lsl CONST]": 649,
 "[arm_r4,arm_r6,lsl CONST]": 649,
 "[reg_base_pointer-3]": 646,
 "zip2": 646,
 "[arm_r3,reg_base_pointer,lsl CONST]": 646,
 "[r13+rbx+CONST]": 644,
 "v3.s[0]": 644,
 "[reg_base_pointer+rax*2]": 643,
 "d23": 642,
 "[x0,w21,sxtw CONST]": 642,
 "[x10,x8]": 642,
 "[rbx+reg_base_pointer*8]": 641,
 "[rbx+rax*2+CONST]": 640,
 "[x21,x1,lsl CONST]": 640,
 "vpsllq": 640,
 "[r15+r12]": 639,
 "[r12+r14]": 639,
 "[r12+rax*4+CONST]": 638,
 "[rax+rsi*2]": 637,
 "v3.2d": 637,
 "[x24,x19,lsl CONST]": 637,
 "[r15+r15]": 636,
 "[rbx+rdx*4]": 634,
 "[r12+reg_base_pointer*8]": 633,
 "[rsi+r9]": 633,
 "[lr,arm_r1]": 633,
 "fabd": 633,
 "[x20,x1]": 633,
 "setnp": 631,
 "[rdx+rdx+CONST]": 631,
 "[arm_r0,lr]": 631,
 "[reg_base_pointer+rdx*4]": 630,
 "[x19,x8]": 630,
 "[arm_r2,arm_r5]": 630,
 "[x0,x10]": 629,
 "[r13+rax*8+CONST]": 628,
 "[r15+rdx+CONST]": 628,
 "[rbx+r12+CONST]": 628,
 "[rax+r13*4]": 627,
 "[rdi+rdx*8]": 627,
 "lsr arm_r1": 627,
 "[r14*8]": 626,
 "[rbx+r15+CONST]": 626,
 "[r9+r9]": 625,
 "[r11-CONST]": 625,
 "[r13+reg_base_pointer]": 624,
 "[x0,w1,uxtw]": 624,
 "negs": 624,
 "[ebx+reg_base_pointer+CONST]": 622,
 "[rdi+r14]": 621,
 "[arm_r6,arm_r7,lsl CONST]": 621,
 "[r15+r14*8]": 620,
 "[edi+edi*8]": 620,
 "paddsw": 620,
 "cmnne": 619,
 "[x0,x23]": 619,
 "[esi+reg_base_pointer*4+CONST]": 619,
 "v3.2s": 619,
 "[r11+rdx]": 618,
 "uxtb CONST": 617,
 "[ebx+ecx*2]": 615,
 "[reg_stack_pointer+eax*8+CONST]": 614,
 "[r10+r10*2]": 613,
 "[reg_stack_pointer+rax]": 613,
 "v23.4s": 613,
 "[x5,x3]": 612,
 "[r15+rax*4+CONST]": 611,
 "[rdx+reg_base_pointer]": 611,
 "-CONST($t4)": 611,
 "[r14+rax*8+CONST]": 610,
 "[x23,x0]": 610,
 "[x30,CONST]": 610,
 "[rdx+rsi+CONST]": 609,
 "[rsi+rax*8+CONST]": 609,
 "[eax+ecx*2+CONST]": 609,
 "[x20,x8]": 609,
 "[arm_r0,arm_r7]": 608,
 "v0.h[1]": 608,
 "[rbx*4+CONST]": 607,
 "mul.s": 607,
 "[r12+rax*8+CONST]": 606,
 "asrs": 606,
 "frndint": 606,
 "[arm_r2,arm_r5,lsl CONST]": 604,
 "[sb,arm_r4,lsl CONST]": 604,
 "[ebx+eax*2-CONST]": 602,
 "v26.4s": 602,
 "$f31": 601,
 "[rdx+r13]": 600,
 "[x4,x2,lsl CONST]": 600,
 "sha1rnds4": 600,
 "sha1nexte": 600,
 "[rax+r11]": 599,
 "[x21,x20,lsl CONST]": 598,
 "lsls": 598,
 "[reg_base_pointer+edi*8]": 598,
 "[reg_base_pointer+rbx*8+CONST]": 597,
 "[reg_base_pointer+rbx*4+CONST]": 597,
 "[r12+r14*8]": 597,
 "[arm_r4,arm_r2,lsl CONST]": 597,
 "[rsi+rdx*2]": 596,
 "[edi+eax*2+CONST]": 596,
 "[reg_base_pointer,arm_r3,lsl CONST]": 596,
 "CONST.25000000": 596,
 "[arm_r0,arm_r6]": 595,
 "[r13*2]": 594,
 "cmpge": 594,
 "[r13*4]": 593,
 "v4.2s": 593,
 "[rcx+rax*2+CONST]": 591,
 "[esi+eax-CONST]": 591,
 "[arm_r0,arm_r7,lsl CONST]": 591,
 "[r12+rax*2]": 590,
 "[ebx+reg_base_pointer*4]": 590,
 "[reg_base_pointer+edx-CONST]": 590,
 "uabd": 590,
 "[rsi+rbx]": 589,
 "[rcx+r13]": 589,
 "[r10+rax+CONST]": 587,
 "[r15+r13]": 587,
 "[edx+edi*2]": 587,
 "[arm_r3,sl]": 587,
 "[reg_base_pointer+r12]": 585,
 "[rdi*8]": 585,
 "[arm_r7,arm_r6,lsl CONST]": 585,
 "[sl,arm_r2]": 585,
 "[edx+esi*4+CONST]": 584,
 "orrls": 584,
 "[rax+rdi*8]": 583,
 "[edi+esi*2]": 583,
 "[rdx+rax*2+CONST]": 582,
 "[arm_r8,arm_r3,lsl CONST]": 582,
 "[r13-8]": 581,
 "[arm_r6,arm_r7]": 581,
 "v1.s[0]": 581,
 "[r14+rdx+CONST]": 580,
 "prfm": 580,
 "[x0,w2,sxtw]": 579,
 "setp": 578,
 "[rcx+r14]": 578,
 "[edi+reg_base_pointer*4+CONST]": 578,
 "[rax+r12+CONST]": 576,
 "[eax+edi*8+CONST]": 573,
 "[x1,x5]": 573,
 "[reg_base_pointer+rbx*4]": 571,
 "[r15+r15*2]": 571,
 "[r13+rax*4+CONST]": 570,
 "add.s": 570,
 "[rdx+r10]": 568,
 "rsble": 568,
 "[rcx+r15]": 567,
 "[rbx+rcx*4+CONST]": 567,
 "[arm_r6,arm_r5]": 567,
 "orrhi": 567,
 "[rdi+rcx*8]": 566,
 "[r13+r14]": 566,
 "[x8,x10]": 565,
 "[x13,-CONST]": 564,
 "[arm_r7,arm_r4]": 562,
 "[x5,x0,lsl CONST]": 561,
 "ud2": 561,
 "[rcx+rdx*8+CONST]": 561,
 "[x18]": 560,
 "pldl1strm": 560,
 "v0.h[2]": 560,
 "v0.h[4]": 560,
 "[x20,x19]": 559,
 "[rbx+rdx*8+CONST]": 558,
 "[arm_r0,arm_r5]": 558,
 "[x5,x2]": 558,
 "[x21,x19]": 557,
 "[r9+rsi]": 557,
 "[ebx+eax*2+CONST]": 557,
 "lock add": 555,
 "[reg_base_pointer+edx*2]": 555,
 "[arm_r7,arm_r5,lsl CONST]": 554,
 "[arm_r4,arm_r0,lsl CONST]": 554,
 "[r8+rax*2]": 553,
 "[ecx+esi*8]": 553,
 "[x17]": 553,
 "[rsi+rcx*8]": 552,
 "[r15*8]": 552,
 "ldrheq": 552,
 "v31.8h": 552,
 "[x19,x2]": 552,
 "[x0,x7]": 552,
 "[rdi+r11]": 551,
 "cmpnlesd": 551,
 "[rcx+r10]": 551,
 "[arm_r7,arm_r5]": 551,
 "v2.s[0]": 551,
 "[r12+r12*4]": 550,
 "[ebx+eax*8-CONST]": 550,
 "[arm_r4,arm_r6]": 546,
 "[rsi+rax*2+CONST]": 545,
 "ldrhs": 545,
 "[reg_stack_pointer+ecx+CONST]": 545,
 "[r15+rcx+CONST]": 544,
 "[x9,x10]": 544,
 "[ecx+esi*4+CONST]": 544,
 "[rbx+rsi+CONST]": 543,
 "[x2,w0,sxtw]": 542,
 "[rdi+rdi*4]": 541,
 "v28.4s": 541,
 "[reg_pc,arm_r2]": 540,
 "rsbeq": 540,
 "psubsw": 540,
 "[r8+r8*2]": 539,
 "[reg_base_pointer+r14*8]": 538,
 "$f17": 538,
 "[reg_pc,arm_r0,lsl CONST]": 538,
 "[eax+reg_base_pointer*2]": 537,
 "[r15+r14]": 536,
 "v22.8b": 536,
 "v29.2d": 535,
 "[x24,x0]": 534,
 "[ecx+esi-CONST]": 533,
 "[x2,x4]": 533,
 "[r13+r15]": 532,
 "[x19,x21,lsl CONST]": 532,
 "[rdx+rbx*4]": 530,
 "prefetcht0": 530,
 "rsbpl": 530,
 "v3.8b": 530,
 "[rax+reg_base_pointer*2]": 529,
 "[reg_base_pointer+edx*8]": 529,
 "umov": 529,
 "[rdi+rbx*4]": 528,
 "trunc.l.d": 528,
 "[x0,x22,lsl CONST]": 528,
 "[x2,w1,sxtw CONST]": 528,
 "[x6,x1]": 527,
 "[rcx+rsi+CONST]": 527,
 "[sl,arm_r4,lsl CONST]": 527,
 "[arm_r1,arm_r4]": 526,
 "[arm_r2,arm_r7]": 526,
 "[x23,x0,lsl CONST]": 525,
 "[reg_base_pointer+ecx*4+CONST]": 525,
 "[arm_r1,arm_r4,lsl CONST]": 524,
 "[esi+ecx*8]": 522,
 "v5.2d": 522,
 "$f18": 522,
 "dsbh": 521,
 "dshd": 521,
 "[x0,x4,lsl CONST]": 521,
 "[x25,x19,lsl CONST]": 521,
 "[r9+r9*2]": 520,
 "[arm_r3,reg_base_pointer]": 520,
 "[arm_r5,arm_r7]": 520,
 "[x2,x4,lsl CONST]": 520,
 "[r8+rdx*4]": 519,
 "[reg_base_pointer+ebx*4+CONST]": 519,
 "[r12-8]": 517,
 "[rdi+r15]": 516,
 "[reg_base_pointer+rax*2-CONST]": 516,
 "[x8,x0]": 516,
 "pavgb": 514,
 "[arm_r2,lr]": 514,
 "[r9*4]": 512,
 "[x20,x1,lsl CONST]": 511,
 "pmuludq": 511,
 "[r13+r13*2]": 511,
 "pophs": 510,
 "uaddl": 510,
 "[r13+rax*2]": 509,
 "[reg_base_pointer+rdx*8]": 508,
